{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"58666ed2c34872100f321a2ed4013124","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"glide.heartbeat","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T04:54:24.000Z","processed_time":1758346004216,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"100","processed":"2025-09-20 04:54:30","sys_updated_on":"2025-09-20 04:54:30","partition":"95","sys_updated_by":"system","process_on":"2025-09-20 04:54:24"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"58666ed2c34872100f321a2ed4013124","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758344064000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":1},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"100\",\"instance\":\"\",\"process_on\":\"2025-09-20 04:54:24\",\"user_name\":\"\",\"sys_mod_count\":\"1\",\"sys_updated_on\":\"2025-09-20 04:54:30\",\"uri\":\"\",\"processed\":\"2025-09-20 04:54:30\",\"rollback_context_id\":\"\",\"sys_id\":\"58666ed2c34872100f321a2ed4013124\",\"partition\":\"95\",\"sys_updated_by\":\"system\",\"user_id\":\"\",\"sys_created_on\":\"2025-09-20 04:54:24\",\"processing_duration\":\"0\",\"name\":\"glide.heartbeat\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"\",\"queue\":\"\",\"sys_created_by\":\"system\",\"table\":\"\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"58962216c34872100f321a2ed40131cf","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"flow.fire","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T04:55:13.000Z","processed_time":1758346004218,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"5","processed":"2025-09-20 04:55:14","instance":"d09622169d4872107e2f679acf8018cf","partition":"37","sys_updated_by":"system","process_on":"2025-09-20 04:55:13","sys_updated_on":"2025-09-20 04:55:14","queue":"flow_engine"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"58962216c34872100f321a2ed40131cf","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758344113000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":0},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"5\",\"instance\":\"d09622169d4872107e2f679acf8018cf\",\"process_on\":\"2025-09-20 04:55:13\",\"user_name\":\"admin\",\"sys_mod_count\":\"0\",\"sys_updated_on\":\"2025-09-20 04:55:14\",\"uri\":\"\",\"processed\":\"2025-09-20 04:55:14\",\"rollback_context_id\":\"\",\"sys_id\":\"58962216c34872100f321a2ed40131cf\",\"partition\":\"37\",\"sys_updated_by\":\"system\",\"user_id\":\"6816f79cc0a8016401c5a33be04be441\",\"sys_created_on\":\"2025-09-20 04:55:13\",\"processing_duration\":\"155\",\"name\":\"flow.fire\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"{\\\"originalInputs\\\":true,\\\"inputKey\\\":\\\"1896221671487210486770a9130054cf\\\",\\\"retryAttempts\\\":1}\",\"queue\":\"flow_engine\",\"sys_created_by\":\"admin\",\"table\":\"sys_flow_context\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"58962216c34872100f321a2ed40131d0","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"flow.fire","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T04:55:13.000Z","processed_time":1758346004220,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"5","processed":"2025-09-20 04:55:14","instance":"d096221621487210cc4313c253ac04d0","partition":"14","sys_updated_by":"system","process_on":"2025-09-20 04:55:13","sys_updated_on":"2025-09-20 04:55:14","queue":"flow_engine"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"58962216c34872100f321a2ed40131d0","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758344113000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":0},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"5\",\"instance\":\"d096221621487210cc4313c253ac04d0\",\"process_on\":\"2025-09-20 04:55:13\",\"user_name\":\"admin\",\"sys_mod_count\":\"0\",\"sys_updated_on\":\"2025-09-20 04:55:14\",\"uri\":\"\",\"processed\":\"2025-09-20 04:55:14\",\"rollback_context_id\":\"\",\"sys_id\":\"58962216c34872100f321a2ed40131d0\",\"partition\":\"14\",\"sys_updated_by\":\"system\",\"user_id\":\"6816f79cc0a8016401c5a33be04be441\",\"sys_created_on\":\"2025-09-20 04:55:13\",\"processing_duration\":\"163\",\"name\":\"flow.fire\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"{\\\"originalInputs\\\":true,\\\"inputKey\\\":\\\"18962216f94872105f53136d43decdd0\\\",\\\"retryAttempts\\\":1}\",\"queue\":\"flow_engine\",\"sys_created_by\":\"admin\",\"table\":\"sys_flow_context\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"cb966216c34872100f321a2ed4013171","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"glide.heartbeat","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T04:55:24.000Z","processed_time":1758346004222,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"100","processed":"2025-09-20 04:55:31","sys_updated_on":"2025-09-20 04:55:31","partition":"12","sys_updated_by":"system","process_on":"2025-09-20 04:55:24"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"cb966216c34872100f321a2ed4013171","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758344124000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":1},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"100\",\"instance\":\"\",\"process_on\":\"2025-09-20 04:55:24\",\"user_name\":\"\",\"sys_mod_count\":\"1\",\"sys_updated_on\":\"2025-09-20 04:55:31\",\"uri\":\"\",\"processed\":\"2025-09-20 04:55:31\",\"rollback_context_id\":\"\",\"sys_id\":\"cb966216c34872100f321a2ed4013171\",\"partition\":\"12\",\"sys_updated_by\":\"system\",\"user_id\":\"\",\"sys_created_on\":\"2025-09-20 04:55:24\",\"processing_duration\":\"1\",\"name\":\"glide.heartbeat\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"\",\"queue\":\"\",\"sys_created_by\":\"system\",\"table\":\"\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"01766e92c34472100f321a2ed401319d","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T04:54:44.000Z","processed_time":1758346004526,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":"174.129.23.23"},"message":"","unmapped":{"business_rule_count":"5","request_param_size":"280","type":"rest","sql_count":"34","client_transaction":"false","start_process_at":"2025-09-20 04:54:44","sql_time":"9","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"1","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"true","largest_chunk_written":"347","transaction_pattern.value":"224333909","output_length":"357","acl_time":"1","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=224333909","render_size":"1176","transaction_number":"2899","origin_scope.value":"a51d46e3f2014110366b10017c5ba675","has_call_chain":"false","response_time":"52","cpu_usage":"0.0","transaction_processing_time":"52","app_scope":"sn_vsc","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"01766e92c34472100f321a2ed401319d","version":"HTTP/1.1","url":{"path":"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-20T04:22:00.000Z^sys_created_on<2025-09-20T04:24:00.000Z&sysparm_limit=100","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/a51d46e3f2014110366b10017c5ba675","url_string":"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-20T04:22:00.000Z^sys_created_on<2025-09-20T04:24:00.000Z&sysparm_limit=100"},"user_agent":"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)"},"time":1758344084000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":640,"cpu_count":6},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"5\",\"referer\":\"\",\"type\":\"rest\",\"protocol\":\"HTTP/1.1\",\"remote_ip\":\"174.129.23.23\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/a51d46e3f2014110366b10017c5ba675\",\"value\":\"a51d46e3f2014110366b10017c5ba675\"},\"sys_created_on\":\"2025-09-20 04:54:44\",\"sql_time\":\"9\",\"potential_cpu_time\":\"640\",\"sys_created_by\":\"admin\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.0\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=224333909\",\"value\":\"224333909\"},\"request_param_size\":\"280\",\"db_category\":\"\",\"session\":\"C9766E92C34472100F321A2ED401319C\",\"sys_id\":\"01766e92c34472100f321a2ed401319d\",\"client_network_time\":\"\",\"sql_count\":\"34\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-20 04:54:44\",\"table\":\"\",\"user_agent\":\"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)\",\"cpu_time\":\"6\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"1\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"true\",\"interaction_id\":\"\",\"url\":\"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-20T04:22:00.000Z^sys_created_on<2025-09-20T04:24:00.000Z&sysparm_limit=100\",\"browser_time\":\"\",\"largest_chunk_written\":\"347\",\"output_length\":\"357\",\"acl_time\":\"1\",\"ajax_transaction_count\":\"\",\"render_size\":\"1176\",\"transaction_number\":\"2899\",\"has_call_chain\":\"false\",\"response_time\":\"52\",\"transaction_processing_time\":\"52\",\"app_scope\":\"sn_vsc\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"9976ee92c34472100f321a2ed40131bf","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T04:54:44.000Z","processed_time":1758346004528,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":"174.129.23.23"},"message":"","unmapped":{"business_rule_count":"0","request_param_size":"280","type":"rest","sql_count":"22","client_transaction":"false","start_process_at":"2025-09-20 04:54:44","sql_time":"14","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"0","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"true","largest_chunk_written":"512","transaction_pattern.value":"-1626936241","output_length":"978","acl_time":"6","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=-1626936241","render_size":"3457","transaction_number":"2900","origin_scope.value":"global","has_call_chain":"false","response_time":"47","cpu_usage":"0.0","transaction_processing_time":"47","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"9976ee92c34472100f321a2ed40131bf","version":"HTTP/1.1","url":{"path":"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-20T04:22:00.000Z^sys_created_on<2025-09-20T04:24:00.000Z&sysparm_limit=100","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global","url_string":"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-20T04:22:00.000Z^sys_created_on<2025-09-20T04:24:00.000Z&sysparm_limit=100"},"user_agent":"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)"},"time":1758344084000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":1536,"cpu_count":13},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"0\",\"referer\":\"\",\"type\":\"rest\",\"protocol\":\"HTTP/1.1\",\"remote_ip\":\"174.129.23.23\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global\",\"value\":\"global\"},\"sys_created_on\":\"2025-09-20 04:54:44\",\"sql_time\":\"14\",\"potential_cpu_time\":\"1536\",\"sys_created_by\":\"admin\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.0\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=-1626936241\",\"value\":\"-1626936241\"},\"request_param_size\":\"280\",\"db_category\":\"\",\"session\":\"5576EE92C34472100F321A2ED40131BF\",\"sys_id\":\"9976ee92c34472100f321a2ed40131bf\",\"client_network_time\":\"\",\"sql_count\":\"22\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-20 04:54:44\",\"table\":\"\",\"user_agent\":\"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)\",\"cpu_time\":\"13\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"0\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"true\",\"interaction_id\":\"\",\"url\":\"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-20T04:22:00.000Z^sys_created_on<2025-09-20T04:24:00.000Z&sysparm_limit=100\",\"browser_time\":\"\",\"largest_chunk_written\":\"512\",\"output_length\":\"978\",\"acl_time\":\"6\",\"ajax_transaction_count\":\"\",\"render_size\":\"3457\",\"transaction_number\":\"2900\",\"has_call_chain\":\"false\",\"response_time\":\"47\",\"transaction_processing_time\":\"47\",\"app_scope\":\"\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"1456aad2c34872100f321a2ed401317b","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T04:54:49.000Z","processed_time":1758346004530,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"business_rule_count":"13","request_param_size":"0","type":"scheduler","sql_count":"62","client_transaction":"false","start_process_at":"2025-09-20 04:54:07","sql_time":"19","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"0","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"false","largest_chunk_written":"0","transaction_pattern.value":"0","output_length":"0","acl_time":"0","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=0","render_size":"0","transaction_number":"2042767","origin_scope.value":"global","has_call_chain":"false","response_time":"41220","cpu_usage":"0.0","transaction_processing_time":"41220","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"1456aad2c34872100f321a2ed401317b","version":"","url":{"path":"JOB: Check Glide Service Status","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global","url_string":"JOB: Check Glide Service Status"},"user_agent":""},"time":1758344089000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":2638016,"cpu_count":279},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"13\",\"referer\":\"\",\"type\":\"scheduler\",\"protocol\":\"\",\"remote_ip\":\"\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global\",\"value\":\"global\"},\"sys_created_on\":\"2025-09-20 04:54:49\",\"sql_time\":\"19\",\"potential_cpu_time\":\"2638016\",\"sys_created_by\":\"system\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.0\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=0\",\"value\":\"0\"},\"request_param_size\":\"0\",\"db_category\":\"\",\"session\":\"glide.scheduler.worker.7\",\"sys_id\":\"1456aad2c34872100f321a2ed401317b\",\"client_network_time\":\"\",\"sql_count\":\"62\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-20 04:54:07\",\"table\":\"\",\"user_agent\":\"\",\"cpu_time\":\"279\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"0\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"false\",\"interaction_id\":\"\",\"url\":\"JOB: Check Glide Service Status\",\"browser_time\":\"\",\"largest_chunk_written\":\"0\",\"output_length\":\"0\",\"acl_time\":\"0\",\"ajax_transaction_count\":\"\",\"render_size\":\"0\",\"transaction_number\":\"2042767\",\"has_call_chain\":\"false\",\"response_time\":\"41220\",\"transaction_processing_time\":\"41220\",\"app_scope\":\"\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
