{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"dd3f0c66c340b2100f321a2ed40131a5","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"glide.heartbeat","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T12:32:24.000Z","processed_time":1758373484171,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"100","processed":"2025-09-20 12:32:30","sys_updated_on":"2025-09-20 12:32:30","partition":"220","sys_updated_by":"system","process_on":"2025-09-20 12:32:24"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"dd3f0c66c340b2100f321a2ed40131a5","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758371544000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":1},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"100\",\"instance\":\"\",\"process_on\":\"2025-09-20 12:32:24\",\"user_name\":\"\",\"sys_mod_count\":\"1\",\"sys_updated_on\":\"2025-09-20 12:32:30\",\"uri\":\"\",\"processed\":\"2025-09-20 12:32:30\",\"rollback_context_id\":\"\",\"sys_id\":\"dd3f0c66c340b2100f321a2ed40131a5\",\"partition\":\"220\",\"sys_updated_by\":\"system\",\"user_id\":\"\",\"sys_created_on\":\"2025-09-20 12:32:24\",\"processing_duration\":\"0\",\"name\":\"glide.heartbeat\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"\",\"queue\":\"\",\"sys_created_by\":\"system\",\"table\":\"\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"007f40a6c340b2100f321a2ed4013113","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"glide.heartbeat","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T12:33:24.000Z","processed_time":1758373484172,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"100","processed":"2025-09-20 12:33:31","sys_updated_on":"2025-09-20 12:33:31","partition":"196","sys_updated_by":"system","process_on":"2025-09-20 12:33:24"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"007f40a6c340b2100f321a2ed4013113","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758371604000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":1},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"100\",\"instance\":\"\",\"process_on\":\"2025-09-20 12:33:24\",\"user_name\":\"\",\"sys_mod_count\":\"1\",\"sys_updated_on\":\"2025-09-20 12:33:31\",\"uri\":\"\",\"processed\":\"2025-09-20 12:33:31\",\"rollback_context_id\":\"\",\"sys_id\":\"007f40a6c340b2100f321a2ed4013113\",\"partition\":\"196\",\"sys_updated_by\":\"system\",\"user_id\":\"\",\"sys_created_on\":\"2025-09-20 12:33:24\",\"processing_duration\":\"2\",\"name\":\"glide.heartbeat\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"\",\"queue\":\"\",\"sys_created_by\":\"system\",\"table\":\"\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"8e4f082ac38c72100f321a2ed4013187","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T12:32:44.000Z","processed_time":1758373484415,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":"174.129.23.23"},"message":"","unmapped":{"business_rule_count":"0","request_param_size":"280","type":"rest","sql_count":"22","client_transaction":"false","start_process_at":"2025-09-20 12:32:44","sql_time":"13","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"0","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"true","largest_chunk_written":"512","transaction_pattern.value":"-1626936241","output_length":"979","acl_time":"5","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=-1626936241","render_size":"3460","transaction_number":"3522","origin_scope.value":"global","has_call_chain":"false","response_time":"41","cpu_usage":"0.0","transaction_processing_time":"41","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"8e4f082ac38c72100f321a2ed4013187","version":"HTTP/1.1","url":{"path":"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-20T12:00:00.000Z^sys_created_on<2025-09-20T12:02:00.000Z&sysparm_limit=100","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global","url_string":"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-20T12:00:00.000Z^sys_created_on<2025-09-20T12:02:00.000Z&sysparm_limit=100"},"user_agent":"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)"},"time":1758371564000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":1280,"cpu_count":10},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"0\",\"referer\":\"\",\"type\":\"rest\",\"protocol\":\"HTTP/1.1\",\"remote_ip\":\"174.129.23.23\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global\",\"value\":\"global\"},\"sys_created_on\":\"2025-09-20 12:32:44\",\"sql_time\":\"13\",\"potential_cpu_time\":\"1280\",\"sys_created_by\":\"admin\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.0\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=-1626936241\",\"value\":\"-1626936241\"},\"request_param_size\":\"280\",\"db_category\":\"\",\"session\":\"4A4FC42AC38C72100F321A2ED4013188\",\"sys_id\":\"8e4f082ac38c72100f321a2ed4013187\",\"client_network_time\":\"\",\"sql_count\":\"22\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-20 12:32:44\",\"table\":\"\",\"user_agent\":\"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)\",\"cpu_time\":\"10\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"0\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"true\",\"interaction_id\":\"\",\"url\":\"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-20T12:00:00.000Z^sys_created_on<2025-09-20T12:02:00.000Z&sysparm_limit=100\",\"browser_time\":\"\",\"largest_chunk_written\":\"512\",\"output_length\":\"979\",\"acl_time\":\"5\",\"ajax_transaction_count\":\"\",\"render_size\":\"3460\",\"transaction_number\":\"3522\",\"has_call_chain\":\"false\",\"response_time\":\"41\",\"transaction_processing_time\":\"41\",\"app_scope\":\"\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"ce4f8062c34c72100f321a2ed40131d8","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T12:32:44.000Z","processed_time":1758373484417,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":"174.129.23.23"},"message":"","unmapped":{"business_rule_count":"5","request_param_size":"280","type":"rest","sql_count":"34","client_transaction":"false","start_process_at":"2025-09-20 12:32:44","sql_time":"14","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"2","network_time":"0","total_wait_time":"1","largest_input_read":"0","gzip":"true","largest_chunk_written":"512","transaction_pattern.value":"224333909","output_length":"601","acl_time":"4","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=224333909","render_size":"2705","transaction_number":"3521","origin_scope.value":"a51d46e3f2014110366b10017c5ba675","has_call_chain":"false","response_time":"67","cpu_usage":"0.01","transaction_processing_time":"66","app_scope":"sn_vsc","semaphore_wait_time":"1"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"ce4f8062c34c72100f321a2ed40131d8","version":"HTTP/1.1","url":{"path":"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-20T12:00:00.000Z^sys_created_on<2025-09-20T12:02:00.000Z&sysparm_limit=100","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/a51d46e3f2014110366b10017c5ba675","url_string":"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-20T12:00:00.000Z^sys_created_on<2025-09-20T12:02:00.000Z&sysparm_limit=100"},"user_agent":"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)"},"time":1758371564000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":768,"cpu_count":9},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"5\",\"referer\":\"\",\"type\":\"rest\",\"protocol\":\"HTTP/1.1\",\"remote_ip\":\"174.129.23.23\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/a51d46e3f2014110366b10017c5ba675\",\"value\":\"a51d46e3f2014110366b10017c5ba675\"},\"sys_created_on\":\"2025-09-20 12:32:44\",\"sql_time\":\"14\",\"potential_cpu_time\":\"768\",\"sys_created_by\":\"admin\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.01\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"1\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=224333909\",\"value\":\"224333909\"},\"request_param_size\":\"280\",\"db_category\":\"\",\"session\":\"8A4F0862C34C72100F321A2ED40131D2\",\"sys_id\":\"ce4f8062c34c72100f321a2ed40131d8\",\"client_network_time\":\"\",\"sql_count\":\"34\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-20 12:32:44\",\"table\":\"\",\"user_agent\":\"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)\",\"cpu_time\":\"9\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"2\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"1\",\"gzip\":\"true\",\"interaction_id\":\"\",\"url\":\"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-20T12:00:00.000Z^sys_created_on<2025-09-20T12:02:00.000Z&sysparm_limit=100\",\"browser_time\":\"\",\"largest_chunk_written\":\"512\",\"output_length\":\"601\",\"acl_time\":\"4\",\"ajax_transaction_count\":\"\",\"render_size\":\"2705\",\"transaction_number\":\"3521\",\"has_call_chain\":\"false\",\"response_time\":\"67\",\"transaction_processing_time\":\"66\",\"app_scope\":\"sn_vsc\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"a24f8466c340b2100f321a2ed401310e","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T12:33:27.000Z","processed_time":1758373484419,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"business_rule_count":"13","request_param_size":"0","type":"scheduler","sql_count":"62","client_transaction":"false","start_process_at":"2025-09-20 12:32:45","sql_time":"26","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"0","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"false","largest_chunk_written":"0","transaction_pattern.value":"0","output_length":"0","acl_time":"0","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=0","render_size":"0","transaction_number":"2704437","origin_scope.value":"global","has_call_chain":"false","response_time":"41313","cpu_usage":"0.0","transaction_processing_time":"41313","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"a24f8466c340b2100f321a2ed401310e","version":"","url":{"path":"JOB: Check Glide Service Status","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global","url_string":"JOB: Check Glide Service Status"},"user_agent":""},"time":1758371607000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":2643968,"cpu_count":272},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"13\",\"referer\":\"\",\"type\":\"scheduler\",\"protocol\":\"\",\"remote_ip\":\"\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global\",\"value\":\"global\"},\"sys_created_on\":\"2025-09-20 12:33:27\",\"sql_time\":\"26\",\"potential_cpu_time\":\"2643968\",\"sys_created_by\":\"system\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.0\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=0\",\"value\":\"0\"},\"request_param_size\":\"0\",\"db_category\":\"\",\"session\":\"glide.scheduler.worker.7\",\"sys_id\":\"a24f8466c340b2100f321a2ed401310e\",\"client_network_time\":\"\",\"sql_count\":\"62\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-20 12:32:45\",\"table\":\"\",\"user_agent\":\"\",\"cpu_time\":\"272\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"0\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"false\",\"interaction_id\":\"\",\"url\":\"JOB: Check Glide Service Status\",\"browser_time\":\"\",\"largest_chunk_written\":\"0\",\"output_length\":\"0\",\"acl_time\":\"0\",\"ajax_transaction_count\":\"\",\"render_size\":\"0\",\"transaction_number\":\"2704437\",\"has_call_chain\":\"false\",\"response_time\":\"41313\",\"transaction_processing_time\":\"41313\",\"app_scope\":\"\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
