{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"5786e4a2c3c0b2100f321a2ed4013111","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"glide.heartbeat","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T14:14:24.000Z","processed_time":1758379604096,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"100","processed":"2025-09-20 14:14:30","sys_updated_on":"2025-09-20 14:14:30","partition":"43","sys_updated_by":"system","process_on":"2025-09-20 14:14:24"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"5786e4a2c3c0b2100f321a2ed4013111","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758377664000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":1},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"100\",\"instance\":\"\",\"process_on\":\"2025-09-20 14:14:24\",\"user_name\":\"\",\"sys_mod_count\":\"1\",\"sys_updated_on\":\"2025-09-20 14:14:30\",\"uri\":\"\",\"processed\":\"2025-09-20 14:14:30\",\"rollback_context_id\":\"\",\"sys_id\":\"5786e4a2c3c0b2100f321a2ed4013111\",\"partition\":\"43\",\"sys_updated_by\":\"system\",\"user_id\":\"\",\"sys_created_on\":\"2025-09-20 14:14:24\",\"processing_duration\":\"1\",\"name\":\"glide.heartbeat\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"\",\"queue\":\"\",\"sys_created_by\":\"system\",\"table\":\"\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"9bb6a8a2c3c0b2100f321a2ed401318d","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"flow.fire","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T14:15:13.000Z","processed_time":1758379604098,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"5","processed":"2025-09-20 14:15:14","instance":"17b6a8a26dc0b210cf68854c0e82588d","partition":"92","sys_updated_by":"system","process_on":"2025-09-20 14:15:13","sys_updated_on":"2025-09-20 14:15:14","queue":"flow_engine"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"9bb6a8a2c3c0b2100f321a2ed401318d","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758377713000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":0},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"5\",\"instance\":\"17b6a8a26dc0b210cf68854c0e82588d\",\"process_on\":\"2025-09-20 14:15:13\",\"user_name\":\"admin\",\"sys_mod_count\":\"0\",\"sys_updated_on\":\"2025-09-20 14:15:14\",\"uri\":\"\",\"processed\":\"2025-09-20 14:15:14\",\"rollback_context_id\":\"\",\"sys_id\":\"9bb6a8a2c3c0b2100f321a2ed401318d\",\"partition\":\"92\",\"sys_updated_by\":\"system\",\"user_id\":\"6816f79cc0a8016401c5a33be04be441\",\"sys_created_on\":\"2025-09-20 14:15:13\",\"processing_duration\":\"166\",\"name\":\"flow.fire\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"{\\\"originalInputs\\\":true,\\\"inputKey\\\":\\\"5bb6a8a2ecc0b21060fbbcf597d6dc8d\\\",\\\"retryAttempts\\\":1}\",\"queue\":\"flow_engine\",\"sys_created_by\":\"admin\",\"table\":\"sys_flow_context\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"9bb6a8a2c3c0b2100f321a2ed401318e","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"flow.fire","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T14:15:13.000Z","processed_time":1758379604100,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"5","processed":"2025-09-20 14:15:14","instance":"17b6a8a272c0b210c4cf3335b0b62b8e","partition":"93","sys_updated_by":"system","process_on":"2025-09-20 14:15:13","sys_updated_on":"2025-09-20 14:15:14","queue":"flow_engine"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"9bb6a8a2c3c0b2100f321a2ed401318e","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758377713000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":0},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"5\",\"instance\":\"17b6a8a272c0b210c4cf3335b0b62b8e\",\"process_on\":\"2025-09-20 14:15:13\",\"user_name\":\"admin\",\"sys_mod_count\":\"0\",\"sys_updated_on\":\"2025-09-20 14:15:14\",\"uri\":\"\",\"processed\":\"2025-09-20 14:15:14\",\"rollback_context_id\":\"\",\"sys_id\":\"9bb6a8a2c3c0b2100f321a2ed401318e\",\"partition\":\"93\",\"sys_updated_by\":\"system\",\"user_id\":\"6816f79cc0a8016401c5a33be04be441\",\"sys_created_on\":\"2025-09-20 14:15:13\",\"processing_duration\":\"145\",\"name\":\"flow.fire\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"{\\\"originalInputs\\\":true,\\\"inputKey\\\":\\\"5bb6a8a29dc0b2107ecb357568622d8e\\\",\\\"retryAttempts\\\":1}\",\"queue\":\"flow_engine\",\"sys_created_by\":\"admin\",\"table\":\"sys_flow_context\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"86c6e8a2c3c0b2100f321a2ed401310a","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"glide.heartbeat","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T14:15:24.000Z","processed_time":1758379604102,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"100","processed":"2025-09-20 14:15:30","sys_updated_on":"2025-09-20 14:15:30","partition":"89","sys_updated_by":"system","process_on":"2025-09-20 14:15:24"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"86c6e8a2c3c0b2100f321a2ed401310a","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758377724000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":1},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"100\",\"instance\":\"\",\"process_on\":\"2025-09-20 14:15:24\",\"user_name\":\"\",\"sys_mod_count\":\"1\",\"sys_updated_on\":\"2025-09-20 14:15:30\",\"uri\":\"\",\"processed\":\"2025-09-20 14:15:30\",\"rollback_context_id\":\"\",\"sys_id\":\"86c6e8a2c3c0b2100f321a2ed401310a\",\"partition\":\"89\",\"sys_updated_by\":\"system\",\"user_id\":\"\",\"sys_created_on\":\"2025-09-20 14:15:24\",\"processing_duration\":\"1\",\"name\":\"glide.heartbeat\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"\",\"queue\":\"\",\"sys_created_by\":\"system\",\"table\":\"\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"1ca6ece6c300b2100f321a2ed4013146","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T14:14:44.000Z","processed_time":1758379604349,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":"34.196.129.226"},"message":"","unmapped":{"business_rule_count":"5","request_param_size":"280","type":"rest","sql_count":"34","client_transaction":"false","start_process_at":"2025-09-20 14:14:44","sql_time":"13","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"1","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"true","largest_chunk_written":"350","transaction_pattern.value":"224333909","output_length":"360","acl_time":"2","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=224333909","render_size":"1176","transaction_number":"3661","origin_scope.value":"a51d46e3f2014110366b10017c5ba675","has_call_chain":"false","response_time":"42","cpu_usage":"0.01","transaction_processing_time":"42","app_scope":"sn_vsc","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"1ca6ece6c300b2100f321a2ed4013146","version":"HTTP/1.1","url":{"path":"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-20T13:42:00.000Z^sys_created_on<2025-09-20T13:44:00.000Z&sysparm_limit=100","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/a51d46e3f2014110366b10017c5ba675","url_string":"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-20T13:42:00.000Z^sys_created_on<2025-09-20T13:44:00.000Z&sysparm_limit=100"},"user_agent":"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)"},"time":1758377684000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":512,"cpu_count":6},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"5\",\"referer\":\"\",\"type\":\"rest\",\"protocol\":\"HTTP/1.1\",\"remote_ip\":\"34.196.129.226\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/a51d46e3f2014110366b10017c5ba675\",\"value\":\"a51d46e3f2014110366b10017c5ba675\"},\"sys_created_on\":\"2025-09-20 14:14:44\",\"sql_time\":\"13\",\"potential_cpu_time\":\"512\",\"sys_created_by\":\"admin\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.01\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=224333909\",\"value\":\"224333909\"},\"request_param_size\":\"280\",\"db_category\":\"\",\"session\":\"D4A6A4E6C300B2100F321A2ED401314F\",\"sys_id\":\"1ca6ece6c300b2100f321a2ed4013146\",\"client_network_time\":\"\",\"sql_count\":\"34\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-20 14:14:44\",\"table\":\"\",\"user_agent\":\"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)\",\"cpu_time\":\"6\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"1\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"true\",\"interaction_id\":\"\",\"url\":\"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-20T13:42:00.000Z^sys_created_on<2025-09-20T13:44:00.000Z&sysparm_limit=100\",\"browser_time\":\"\",\"largest_chunk_written\":\"350\",\"output_length\":\"360\",\"acl_time\":\"2\",\"ajax_transaction_count\":\"\",\"render_size\":\"1176\",\"transaction_number\":\"3661\",\"has_call_chain\":\"false\",\"response_time\":\"42\",\"transaction_processing_time\":\"42\",\"app_scope\":\"sn_vsc\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"50a62862c34c72100f321a2ed40131d8","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T14:14:44.000Z","processed_time":1758379604351,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":"174.129.23.23"},"message":"","unmapped":{"business_rule_count":"0","request_param_size":"280","type":"rest","sql_count":"27","client_transaction":"false","start_process_at":"2025-09-20 14:14:44","sql_time":"18","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"0","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"true","largest_chunk_written":"512","transaction_pattern.value":"-1626936241","output_length":"999","acl_time":"5","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=-1626936241","render_size":"3459","transaction_number":"3662","origin_scope.value":"global","has_call_chain":"false","response_time":"50","cpu_usage":"0.0","transaction_processing_time":"50","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"50a62862c34c72100f321a2ed40131d8","version":"HTTP/1.1","url":{"path":"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-20T13:42:00.000Z^sys_created_on<2025-09-20T13:44:00.000Z&sysparm_limit=100","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global","url_string":"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-20T13:42:00.000Z^sys_created_on<2025-09-20T13:44:00.000Z&sysparm_limit=100"},"user_agent":"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)"},"time":1758377684000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":1472,"cpu_count":11},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"0\",\"referer\":\"\",\"type\":\"rest\",\"protocol\":\"HTTP/1.1\",\"remote_ip\":\"174.129.23.23\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global\",\"value\":\"global\"},\"sys_created_on\":\"2025-09-20 14:14:44\",\"sql_time\":\"18\",\"potential_cpu_time\":\"1472\",\"sys_created_by\":\"admin\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.0\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=-1626936241\",\"value\":\"-1626936241\"},\"request_param_size\":\"280\",\"db_category\":\"\",\"session\":\"1CA62862C34C72100F321A2ED40131D7\",\"sys_id\":\"50a62862c34c72100f321a2ed40131d8\",\"client_network_time\":\"\",\"sql_count\":\"27\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-20 14:14:44\",\"table\":\"\",\"user_agent\":\"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)\",\"cpu_time\":\"11\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"0\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"true\",\"interaction_id\":\"\",\"url\":\"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-20T13:42:00.000Z^sys_created_on<2025-09-20T13:44:00.000Z&sysparm_limit=100\",\"browser_time\":\"\",\"largest_chunk_written\":\"512\",\"output_length\":\"999\",\"acl_time\":\"5\",\"ajax_transaction_count\":\"\",\"render_size\":\"3459\",\"transaction_number\":\"3662\",\"has_call_chain\":\"false\",\"response_time\":\"50\",\"transaction_processing_time\":\"50\",\"app_scope\":\"\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
