{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"33721e3fc34c32100f321a2ed4013199","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"glide.heartbeat","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-24T19:18:24.000Z","processed_time":1758743444128,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"100","processed":"2025-09-24 19:18:30","sys_updated_on":"2025-09-24 19:18:30","partition":"206","sys_updated_by":"system","process_on":"2025-09-24 19:18:24"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"33721e3fc34c32100f321a2ed4013199","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758741504000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":1},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"100\",\"instance\":\"\",\"process_on\":\"2025-09-24 19:18:24\",\"user_name\":\"\",\"sys_mod_count\":\"1\",\"sys_updated_on\":\"2025-09-24 19:18:30\",\"uri\":\"\",\"processed\":\"2025-09-24 19:18:30\",\"rollback_context_id\":\"\",\"sys_id\":\"33721e3fc34c32100f321a2ed4013199\",\"partition\":\"206\",\"sys_updated_by\":\"system\",\"user_id\":\"\",\"sys_created_on\":\"2025-09-24 19:18:24\",\"processing_duration\":\"1\",\"name\":\"glide.heartbeat\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"\",\"queue\":\"\",\"sys_created_by\":\"system\",\"table\":\"\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"dab2127fc34c32100f321a2ed40131b0","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"glide.heartbeat","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-24T19:19:24.000Z","processed_time":1758743444132,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"100","processed":"2025-09-24 19:19:30","sys_updated_on":"2025-09-24 19:19:30","partition":"63","sys_updated_by":"system","process_on":"2025-09-24 19:19:24"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"dab2127fc34c32100f321a2ed40131b0","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758741564000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":1},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"100\",\"instance\":\"\",\"process_on\":\"2025-09-24 19:19:24\",\"user_name\":\"\",\"sys_mod_count\":\"1\",\"sys_updated_on\":\"2025-09-24 19:19:30\",\"uri\":\"\",\"processed\":\"2025-09-24 19:19:30\",\"rollback_context_id\":\"\",\"sys_id\":\"dab2127fc34c32100f321a2ed40131b0\",\"partition\":\"63\",\"sys_updated_by\":\"system\",\"user_id\":\"\",\"sys_created_on\":\"2025-09-24 19:19:24\",\"processing_duration\":\"0\",\"name\":\"glide.heartbeat\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"\",\"queue\":\"\",\"sys_created_by\":\"system\",\"table\":\"\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"6092d677c30c32100f321a2ed40131c5","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-24T19:18:44.000Z","processed_time":1758743444430,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":"34.196.129.226"},"message":"","unmapped":{"business_rule_count":"0","request_param_size":"280","type":"rest","sql_count":"22","client_transaction":"false","start_process_at":"2025-09-24 19:18:44","sql_time":"15","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"0","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"true","largest_chunk_written":"512","transaction_pattern.value":"-1626936241","output_length":"999","acl_time":"5","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=-1626936241","render_size":"3460","transaction_number":"3854","origin_scope.value":"global","has_call_chain":"false","response_time":"42","cpu_usage":"0.0","transaction_processing_time":"42","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"6092d677c30c32100f321a2ed40131c5","version":"HTTP/1.1","url":{"path":"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-24T18:46:00.000Z^sys_created_on<2025-09-24T18:48:00.000Z&sysparm_limit=100","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global","url_string":"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-24T18:46:00.000Z^sys_created_on<2025-09-24T18:48:00.000Z&sysparm_limit=100"},"user_agent":"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)"},"time":1758741524000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":1472,"cpu_count":12},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"0\",\"referer\":\"\",\"type\":\"rest\",\"protocol\":\"HTTP/1.1\",\"remote_ip\":\"34.196.129.226\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global\",\"value\":\"global\"},\"sys_created_on\":\"2025-09-24 19:18:44\",\"sql_time\":\"15\",\"potential_cpu_time\":\"1472\",\"sys_created_by\":\"admin\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.0\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=-1626936241\",\"value\":\"-1626936241\"},\"request_param_size\":\"280\",\"db_category\":\"\",\"session\":\"2C925677C30C32100F321A2ED40131C6\",\"sys_id\":\"6092d677c30c32100f321a2ed40131c5\",\"client_network_time\":\"\",\"sql_count\":\"22\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-24 19:18:44\",\"table\":\"\",\"user_agent\":\"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)\",\"cpu_time\":\"12\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"0\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"true\",\"interaction_id\":\"\",\"url\":\"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-24T18:46:00.000Z^sys_created_on<2025-09-24T18:48:00.000Z&sysparm_limit=100\",\"browser_time\":\"\",\"largest_chunk_written\":\"512\",\"output_length\":\"999\",\"acl_time\":\"5\",\"ajax_transaction_count\":\"\",\"render_size\":\"3460\",\"transaction_number\":\"3854\",\"has_call_chain\":\"false\",\"response_time\":\"42\",\"transaction_processing_time\":\"42\",\"app_scope\":\"\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"e89216f3c30c32100f321a2ed40131ee","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-24T19:18:44.000Z","processed_time":1758743444432,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":"100.25.96.245"},"message":"","unmapped":{"business_rule_count":"5","request_param_size":"280","type":"rest","sql_count":"29","client_transaction":"false","start_process_at":"2025-09-24 19:18:44","sql_time":"14","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"1","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"true","largest_chunk_written":"345","transaction_pattern.value":"224333909","output_length":"355","acl_time":"2","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=224333909","render_size":"1176","transaction_number":"3853","origin_scope.value":"a51d46e3f2014110366b10017c5ba675","has_call_chain":"false","response_time":"51","cpu_usage":"0.0","transaction_processing_time":"51","app_scope":"sn_vsc","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"e89216f3c30c32100f321a2ed40131ee","version":"HTTP/1.1","url":{"path":"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-24T18:46:00.000Z^sys_created_on<2025-09-24T18:48:00.000Z&sysparm_limit=100","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/a51d46e3f2014110366b10017c5ba675","url_string":"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-24T18:46:00.000Z^sys_created_on<2025-09-24T18:48:00.000Z&sysparm_limit=100"},"user_agent":"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)"},"time":1758741524000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":512,"cpu_count":5},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"5\",\"referer\":\"\",\"type\":\"rest\",\"protocol\":\"HTTP/1.1\",\"remote_ip\":\"100.25.96.245\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/a51d46e3f2014110366b10017c5ba675\",\"value\":\"a51d46e3f2014110366b10017c5ba675\"},\"sys_created_on\":\"2025-09-24 19:18:44\",\"sql_time\":\"14\",\"potential_cpu_time\":\"512\",\"sys_created_by\":\"admin\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.0\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=224333909\",\"value\":\"224333909\"},\"request_param_size\":\"280\",\"db_category\":\"\",\"session\":\"A4929EF3C30C32100F321A2ED40131E4\",\"sys_id\":\"e89216f3c30c32100f321a2ed40131ee\",\"client_network_time\":\"\",\"sql_count\":\"29\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-24 19:18:44\",\"table\":\"\",\"user_agent\":\"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)\",\"cpu_time\":\"5\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"1\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"true\",\"interaction_id\":\"\",\"url\":\"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-24T18:46:00.000Z^sys_created_on<2025-09-24T18:48:00.000Z&sysparm_limit=100\",\"browser_time\":\"\",\"largest_chunk_written\":\"345\",\"output_length\":\"355\",\"acl_time\":\"2\",\"ajax_transaction_count\":\"\",\"render_size\":\"1176\",\"transaction_number\":\"3853\",\"has_call_chain\":\"false\",\"response_time\":\"51\",\"transaction_processing_time\":\"51\",\"app_scope\":\"sn_vsc\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"d762de3fc34c32100f321a2ed40131ea","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-24T19:18:47.000Z","processed_time":1758743444434,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"business_rule_count":"13","request_param_size":"0","type":"scheduler","sql_count":"62","client_transaction":"false","start_process_at":"2025-09-24 19:18:06","sql_time":"28","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"0","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"false","largest_chunk_written":"0","transaction_pattern.value":"0","output_length":"0","acl_time":"0","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=0","render_size":"0","transaction_number":"1105023","origin_scope.value":"global","has_call_chain":"false","response_time":"41198","cpu_usage":"0.0","transaction_processing_time":"41198","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"d762de3fc34c32100f321a2ed40131ea","version":"","url":{"path":"JOB: Check Glide Service Status","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global","url_string":"JOB: Check Glide Service Status"},"user_agent":""},"time":1758741527000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":2636544,"cpu_count":256},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"13\",\"referer\":\"\",\"type\":\"scheduler\",\"protocol\":\"\",\"remote_ip\":\"\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global\",\"value\":\"global\"},\"sys_created_on\":\"2025-09-24 19:18:47\",\"sql_time\":\"28\",\"potential_cpu_time\":\"2636544\",\"sys_created_by\":\"system\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.0\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=0\",\"value\":\"0\"},\"request_param_size\":\"0\",\"db_category\":\"\",\"session\":\"glide.scheduler.worker.0\",\"sys_id\":\"d762de3fc34c32100f321a2ed40131ea\",\"client_network_time\":\"\",\"sql_count\":\"62\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-24 19:18:06\",\"table\":\"\",\"user_agent\":\"\",\"cpu_time\":\"256\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"0\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"false\",\"interaction_id\":\"\",\"url\":\"JOB: Check Glide Service Status\",\"browser_time\":\"\",\"largest_chunk_written\":\"0\",\"output_length\":\"0\",\"acl_time\":\"0\",\"ajax_transaction_count\":\"\",\"render_size\":\"0\",\"transaction_number\":\"1105023\",\"has_call_chain\":\"false\",\"response_time\":\"41198\",\"transaction_processing_time\":\"41198\",\"app_scope\":\"\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
