{"activity_name":"Other","category_uid":3,"metadata":{"uid":"fb500e3e-a3b8-4836-8b32-8ad694d38c19","product":{"name":"PingIdentity","vendor_name":"PingIdentity"},"event_code":"SESSION.UPDATED","profiles":["host","datetime"],"original_time":"2025-09-27T04:09:48.496Z","processed_time":1758948108339,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Authorize Session: Other","category_name":"Identity & Access Management","message":"Session Updated","unmapped":{"createdAt":"2025-09-27T04:09:48.518Z","resources[0].href":"https://api.pingone.com/v1/environments/63452aba-9928-456d-a4eb-28c04b255c21/users/160893a1-baf0-4ab0-9fb6-4504d8ab63d1","resources[1].id":"14d0e552-20df-4b1a-98ff-45517cb0b51c","resources[1].type":"SESSION","resources[1].environment.id":"63452aba-9928-456d-a4eb-28c04b255c21","resources[1].name":"User Session 14d0e552-20df-4b1a-98ff-45517cb0b51c","resources[0].environment.id":"63452aba-9928-456d-a4eb-28c04b255c21","_links.self.href":"https://api.pingone.com/v1/environments/63452aba-9928-456d-a4eb-28c04b255c21/activities/fb500e3e-a3b8-4836-8b32-8ad694d38c19","resources[1].href":"https://api.pingone.com/v1/environments/63452aba-9928-456d-a4eb-28c04b255c21/sessions/14d0e552-20df-4b1a-98ff-45517cb0b51c","resources[0].population.id":"6360a852-2ed9-43ee-bed8-5e1320acd0b1"},"actor":{"user":{"name":"","type":"SYSTEM","uid":""},"session":{"uid":""}},"class_uid":3003,"activity_id":99,"time":1758946188496,"severity_id":0,"class_name":"Authorize Session","user":{"name":"neerajkumar.meena@trianz.com","type":"USER","uid":"160893a1-baf0-4ab0-9fb6-4504d8ab63d1"},"raw_data":"{\"_links\":{\"self\":{\"href\":\"https://api.pingone.com/v1/environments/63452aba-9928-456d-a4eb-28c04b255c21/activities/fb500e3e-a3b8-4836-8b32-8ad694d38c19\"}},\"id\":\"fb500e3e-a3b8-4836-8b32-8ad694d38c19\",\"recordedAt\":\"2025-09-27T04:09:48.496Z\",\"createdAt\":\"2025-09-27T04:09:48.518Z\",\"correlationId\":\"478b2519-37cf-4186-9f5f-76187a9f8633\",\"source\":{\"userAgent\":\"Apache-HttpClient/UNAVAILABLE (Java/17.0.16)\",\"ipAddress\":\"3.216.42.202\"},\"action\":{\"type\":\"SESSION.UPDATED\",\"description\":\"Session Updated\"},\"resources\":[{\"type\":\"USER\",\"id\":\"160893a1-baf0-4ab0-9fb6-4504d8ab63d1\",\"name\":\"neerajkumar.meena@trianz.com\",\"environment\":{\"id\":\"63452aba-9928-456d-a4eb-28c04b255c21\"},\"population\":{\"id\":\"6360a852-2ed9-43ee-bed8-5e1320acd0b1\"},\"href\":\"https://api.pingone.com/v1/environments/63452aba-9928-456d-a4eb-28c04b255c21/users/160893a1-baf0-4ab0-9fb6-4504d8ab63d1\"},{\"type\":\"SESSION\",\"id\":\"14d0e552-20df-4b1a-98ff-45517cb0b51c\",\"name\":\"User Session 14d0e552-20df-4b1a-98ff-45517cb0b51c\",\"environment\":{\"id\":\"63452aba-9928-456d-a4eb-28c04b255c21\"},\"href\":\"https://api.pingone.com/v1/environments/63452aba-9928-456d-a4eb-28c04b255c21/sessions/14d0e552-20df-4b1a-98ff-45517cb0b51c\"}],\"result\":{\"status\":\"SUCCESS\",\"description\":\"Updated Session '14d0e552-20df-4b1a-98ff-45517cb0b51c' for User '160893a1-baf0-4ab0-9fb6-4504d8ab63d1'\"}}","type_uid":300399,"status":"SUCCESS"}
