{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"44befb52c300b2100f321a2ed401312f","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"flow.fire","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T11:20:14.000Z","processed_time":1758369164138,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"5","processed":"2025-09-20 11:20:15","instance":"ccbefb528100b210fac64af410b0642e","partition":"86","sys_updated_by":"system","process_on":"2025-09-20 11:20:14","sys_updated_on":"2025-09-20 11:20:15","queue":"flow_engine"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"44befb52c300b2100f321a2ed401312f","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758367214000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":0},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"5\",\"instance\":\"ccbefb528100b210fac64af410b0642e\",\"process_on\":\"2025-09-20 11:20:14\",\"user_name\":\"admin\",\"sys_mod_count\":\"0\",\"sys_updated_on\":\"2025-09-20 11:20:15\",\"uri\":\"\",\"processed\":\"2025-09-20 11:20:15\",\"rollback_context_id\":\"\",\"sys_id\":\"44befb52c300b2100f321a2ed401312f\",\"partition\":\"86\",\"sys_updated_by\":\"system\",\"user_id\":\"6816f79cc0a8016401c5a33be04be441\",\"sys_created_on\":\"2025-09-20 11:20:14\",\"processing_duration\":\"126\",\"name\":\"flow.fire\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"{\\\"originalInputs\\\":true,\\\"inputKey\\\":\\\"04befb52b100b210053286e71849f62f\\\",\\\"retryAttempts\\\":1}\",\"queue\":\"flow_engine\",\"sys_created_by\":\"admin\",\"table\":\"sys_flow_context\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"44befb52c300b2100f321a2ed4013130","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"flow.fire","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T11:20:14.000Z","processed_time":1758369164140,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"5","processed":"2025-09-20 11:20:15","instance":"ccbefb52cd00b21003a7d8fa345fec2f","partition":"63","sys_updated_by":"system","process_on":"2025-09-20 11:20:14","sys_updated_on":"2025-09-20 11:20:15","queue":"flow_engine"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"44befb52c300b2100f321a2ed4013130","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758367214000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":0},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"5\",\"instance\":\"ccbefb52cd00b21003a7d8fa345fec2f\",\"process_on\":\"2025-09-20 11:20:14\",\"user_name\":\"admin\",\"sys_mod_count\":\"0\",\"sys_updated_on\":\"2025-09-20 11:20:15\",\"uri\":\"\",\"processed\":\"2025-09-20 11:20:15\",\"rollback_context_id\":\"\",\"sys_id\":\"44befb52c300b2100f321a2ed4013130\",\"partition\":\"63\",\"sys_updated_by\":\"system\",\"user_id\":\"6816f79cc0a8016401c5a33be04be441\",\"sys_created_on\":\"2025-09-20 11:20:14\",\"processing_duration\":\"71\",\"name\":\"flow.fire\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"{\\\"originalInputs\\\":true,\\\"inputKey\\\":\\\"04befb526c00b210e65fe156faa89a30\\\",\\\"retryAttempts\\\":1}\",\"queue\":\"flow_engine\",\"sys_created_by\":\"admin\",\"table\":\"sys_flow_context\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"e2befb52c300b2100f321a2ed40131fc","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"glide.heartbeat","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T11:20:24.000Z","processed_time":1758369164142,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"100","processed":"2025-09-20 11:20:30","sys_updated_on":"2025-09-20 11:20:30","partition":"100","sys_updated_by":"system","process_on":"2025-09-20 11:20:24"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"e2befb52c300b2100f321a2ed40131fc","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758367224000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":1},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"100\",\"instance\":\"\",\"process_on\":\"2025-09-20 11:20:24\",\"user_name\":\"\",\"sys_mod_count\":\"1\",\"sys_updated_on\":\"2025-09-20 11:20:30\",\"uri\":\"\",\"processed\":\"2025-09-20 11:20:30\",\"rollback_context_id\":\"\",\"sys_id\":\"e2befb52c300b2100f321a2ed40131fc\",\"partition\":\"100\",\"sys_updated_by\":\"system\",\"user_id\":\"\",\"sys_created_on\":\"2025-09-20 11:20:24\",\"processing_duration\":\"1\",\"name\":\"glide.heartbeat\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"\",\"queue\":\"\",\"sys_created_by\":\"system\",\"table\":\"\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"9dfe3392c300b2100f321a2ed4013169","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"glide.heartbeat","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T11:21:24.000Z","processed_time":1758369164144,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"100","processed":"2025-09-20 11:21:30","sys_updated_on":"2025-09-20 11:21:30","partition":"108","sys_updated_by":"system","process_on":"2025-09-20 11:21:24"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"9dfe3392c300b2100f321a2ed4013169","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758367284000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":1},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"100\",\"instance\":\"\",\"process_on\":\"2025-09-20 11:21:24\",\"user_name\":\"\",\"sys_mod_count\":\"1\",\"sys_updated_on\":\"2025-09-20 11:21:30\",\"uri\":\"\",\"processed\":\"2025-09-20 11:21:30\",\"rollback_context_id\":\"\",\"sys_id\":\"9dfe3392c300b2100f321a2ed4013169\",\"partition\":\"108\",\"sys_updated_by\":\"system\",\"user_id\":\"\",\"sys_created_on\":\"2025-09-20 11:21:24\",\"processing_duration\":\"1\",\"name\":\"glide.heartbeat\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"\",\"queue\":\"\",\"sys_created_by\":\"system\",\"table\":\"\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"1fce7f9ac3c872100f321a2ed40131fc","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T11:20:44.000Z","processed_time":1758369164425,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":"34.196.129.226"},"message":"","unmapped":{"business_rule_count":"5","request_param_size":"280","type":"rest","sql_count":"34","client_transaction":"false","start_process_at":"2025-09-20 11:20:44","sql_time":"7","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"1","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"true","largest_chunk_written":"347","transaction_pattern.value":"224333909","output_length":"357","acl_time":"1","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=224333909","render_size":"1176","transaction_number":"3423","origin_scope.value":"a51d46e3f2014110366b10017c5ba675","has_call_chain":"false","response_time":"41","cpu_usage":"0.01","transaction_processing_time":"41","app_scope":"sn_vsc","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"1fce7f9ac3c872100f321a2ed40131fc","version":"HTTP/1.1","url":{"path":"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-20T10:48:00.000Z^sys_created_on<2025-09-20T10:50:00.000Z&sysparm_limit=100","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/a51d46e3f2014110366b10017c5ba675","url_string":"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-20T10:48:00.000Z^sys_created_on<2025-09-20T10:50:00.000Z&sysparm_limit=100"},"user_agent":"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)"},"time":1758367244000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":576,"cpu_count":6},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"5\",\"referer\":\"\",\"type\":\"rest\",\"protocol\":\"HTTP/1.1\",\"remote_ip\":\"34.196.129.226\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/a51d46e3f2014110366b10017c5ba675\",\"value\":\"a51d46e3f2014110366b10017c5ba675\"},\"sys_created_on\":\"2025-09-20 11:20:44\",\"sql_time\":\"7\",\"potential_cpu_time\":\"576\",\"sys_created_by\":\"admin\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.01\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=224333909\",\"value\":\"224333909\"},\"request_param_size\":\"280\",\"db_category\":\"\",\"session\":\"D7CE3F9AC3C872100F321A2ED40131FD\",\"sys_id\":\"1fce7f9ac3c872100f321a2ed40131fc\",\"client_network_time\":\"\",\"sql_count\":\"34\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-20 11:20:44\",\"table\":\"\",\"user_agent\":\"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)\",\"cpu_time\":\"6\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"1\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"true\",\"interaction_id\":\"\",\"url\":\"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-20T10:48:00.000Z^sys_created_on<2025-09-20T10:50:00.000Z&sysparm_limit=100\",\"browser_time\":\"\",\"largest_chunk_written\":\"347\",\"output_length\":\"357\",\"acl_time\":\"1\",\"ajax_transaction_count\":\"\",\"render_size\":\"1176\",\"transaction_number\":\"3423\",\"has_call_chain\":\"false\",\"response_time\":\"41\",\"transaction_processing_time\":\"41\",\"app_scope\":\"sn_vsc\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"2bce3bdec34872100f321a2ed4013173","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-20T11:20:44.000Z","processed_time":1758369164426,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":"34.196.129.226"},"message":"","unmapped":{"business_rule_count":"0","request_param_size":"280","type":"rest","sql_count":"27","client_transaction":"false","start_process_at":"2025-09-20 11:20:44","sql_time":"13","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"0","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"true","largest_chunk_written":"512","transaction_pattern.value":"-1626936241","output_length":"993","acl_time":"5","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=-1626936241","render_size":"3459","transaction_number":"3424","origin_scope.value":"global","has_call_chain":"false","response_time":"42","cpu_usage":"0.0","transaction_processing_time":"42","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"2bce3bdec34872100f321a2ed4013173","version":"HTTP/1.1","url":{"path":"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-20T10:48:00.000Z^sys_created_on<2025-09-20T10:50:00.000Z&sysparm_limit=100","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global","url_string":"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-20T10:48:00.000Z^sys_created_on<2025-09-20T10:50:00.000Z&sysparm_limit=100"},"user_agent":"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)"},"time":1758367244000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":1280,"cpu_count":9},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"0\",\"referer\":\"\",\"type\":\"rest\",\"protocol\":\"HTTP/1.1\",\"remote_ip\":\"34.196.129.226\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global\",\"value\":\"global\"},\"sys_created_on\":\"2025-09-20 11:20:44\",\"sql_time\":\"13\",\"potential_cpu_time\":\"1280\",\"sys_created_by\":\"admin\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.0\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=-1626936241\",\"value\":\"-1626936241\"},\"request_param_size\":\"280\",\"db_category\":\"\",\"session\":\"E3CEF3DEC34872100F321A2ED4013178\",\"sys_id\":\"2bce3bdec34872100f321a2ed4013173\",\"client_network_time\":\"\",\"sql_count\":\"27\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-20 11:20:44\",\"table\":\"\",\"user_agent\":\"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)\",\"cpu_time\":\"9\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"0\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"true\",\"interaction_id\":\"\",\"url\":\"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-20T10:48:00.000Z^sys_created_on<2025-09-20T10:50:00.000Z&sysparm_limit=100\",\"browser_time\":\"\",\"largest_chunk_written\":\"512\",\"output_length\":\"993\",\"acl_time\":\"5\",\"ajax_transaction_count\":\"\",\"render_size\":\"3459\",\"transaction_number\":\"3424\",\"has_call_chain\":\"false\",\"response_time\":\"42\",\"transaction_processing_time\":\"42\",\"app_scope\":\"\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
