{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"66b9bfd8c35cf2100f321a2ed40131ca","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"glide.heartbeat","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-26T16:06:24.000Z","processed_time":1758904724128,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"100","processed":"2025-09-26 16:06:30","sys_updated_on":"2025-09-26 16:06:30","partition":"165","sys_updated_by":"system","process_on":"2025-09-26 16:06:24"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"66b9bfd8c35cf2100f321a2ed40131ca","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758902784000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":1},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"100\",\"instance\":\"\",\"process_on\":\"2025-09-26 16:06:24\",\"user_name\":\"\",\"sys_mod_count\":\"1\",\"sys_updated_on\":\"2025-09-26 16:06:30\",\"uri\":\"\",\"processed\":\"2025-09-26 16:06:30\",\"rollback_context_id\":\"\",\"sys_id\":\"66b9bfd8c35cf2100f321a2ed40131ca\",\"partition\":\"165\",\"sys_updated_by\":\"system\",\"user_id\":\"\",\"sys_created_on\":\"2025-09-26 16:06:24\",\"processing_duration\":\"0\",\"name\":\"glide.heartbeat\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"\",\"queue\":\"\",\"sys_created_by\":\"system\",\"table\":\"\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"11f9f31cc35cf2100f321a2ed4013149","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"glide.heartbeat","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-26T16:07:24.000Z","processed_time":1758904724131,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"100","processed":"2025-09-26 16:07:30","sys_updated_on":"2025-09-26 16:07:30","partition":"199","sys_updated_by":"system","process_on":"2025-09-26 16:07:24"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"11f9f31cc35cf2100f321a2ed4013149","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758902844000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":1},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"100\",\"instance\":\"\",\"process_on\":\"2025-09-26 16:07:24\",\"user_name\":\"\",\"sys_mod_count\":\"1\",\"sys_updated_on\":\"2025-09-26 16:07:30\",\"uri\":\"\",\"processed\":\"2025-09-26 16:07:30\",\"rollback_context_id\":\"\",\"sys_id\":\"11f9f31cc35cf2100f321a2ed4013149\",\"partition\":\"199\",\"sys_updated_by\":\"system\",\"user_id\":\"\",\"sys_created_on\":\"2025-09-26 16:07:24\",\"processing_duration\":\"1\",\"name\":\"glide.heartbeat\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"\",\"queue\":\"\",\"sys_created_by\":\"system\",\"table\":\"\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"2bc93798c3d8f2100f321a2ed4013168","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-26T16:06:44.000Z","processed_time":1758904724269,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":"100.25.96.245"},"message":"","unmapped":{"business_rule_count":"0","request_param_size":"280","type":"rest","sql_count":"27","client_transaction":"false","start_process_at":"2025-09-26 16:06:44","sql_time":"22","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"0","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"true","largest_chunk_written":"512","transaction_pattern.value":"-1626936241","output_length":"997","acl_time":"4","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=-1626936241","render_size":"3460","transaction_number":"9918","origin_scope.value":"global","has_call_chain":"false","response_time":"45","cpu_usage":"0.0","transaction_processing_time":"45","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"2bc93798c3d8f2100f321a2ed4013168","version":"HTTP/1.1","url":{"path":"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-26T15:34:00.000Z^sys_created_on<2025-09-26T15:36:00.000Z&sysparm_limit=100","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global","url_string":"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-26T15:34:00.000Z^sys_created_on<2025-09-26T15:36:00.000Z&sysparm_limit=100"},"user_agent":"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)"},"time":1758902804000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":1472,"cpu_count":10},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"0\",\"referer\":\"\",\"type\":\"rest\",\"protocol\":\"HTTP/1.1\",\"remote_ip\":\"100.25.96.245\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global\",\"value\":\"global\"},\"sys_created_on\":\"2025-09-26 16:06:44\",\"sql_time\":\"22\",\"potential_cpu_time\":\"1472\",\"sys_created_by\":\"admin\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.0\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=-1626936241\",\"value\":\"-1626936241\"},\"request_param_size\":\"280\",\"db_category\":\"\",\"session\":\"E3C93B98C3D8F2100F321A2ED4013164\",\"sys_id\":\"2bc93798c3d8f2100f321a2ed4013168\",\"client_network_time\":\"\",\"sql_count\":\"27\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-26 16:06:44\",\"table\":\"\",\"user_agent\":\"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)\",\"cpu_time\":\"10\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"0\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"true\",\"interaction_id\":\"\",\"url\":\"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-26T15:34:00.000Z^sys_created_on<2025-09-26T15:36:00.000Z&sysparm_limit=100\",\"browser_time\":\"\",\"largest_chunk_written\":\"512\",\"output_length\":\"997\",\"acl_time\":\"4\",\"ajax_transaction_count\":\"\",\"render_size\":\"3460\",\"transaction_number\":\"9918\",\"has_call_chain\":\"false\",\"response_time\":\"45\",\"transaction_processing_time\":\"45\",\"app_scope\":\"\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"e7c97b54c398f2100f321a2ed401316d","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-26T16:06:44.000Z","processed_time":1758904724271,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":"34.196.129.226"},"message":"","unmapped":{"business_rule_count":"5","request_param_size":"280","type":"rest","sql_count":"29","client_transaction":"false","start_process_at":"2025-09-26 16:06:44","sql_time":"8","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"1","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"true","largest_chunk_written":"512","transaction_pattern.value":"224333909","output_length":"608","acl_time":"2","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=224333909","render_size":"2706","transaction_number":"9917","origin_scope.value":"a51d46e3f2014110366b10017c5ba675","has_call_chain":"false","response_time":"40","cpu_usage":"0.01","transaction_processing_time":"40","app_scope":"sn_vsc","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"e7c97b54c398f2100f321a2ed401316d","version":"HTTP/1.1","url":{"path":"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-26T15:34:00.000Z^sys_created_on<2025-09-26T15:36:00.000Z&sysparm_limit=100","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/a51d46e3f2014110366b10017c5ba675","url_string":"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-26T15:34:00.000Z^sys_created_on<2025-09-26T15:36:00.000Z&sysparm_limit=100"},"user_agent":"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)"},"time":1758902804000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":640,"cpu_count":7},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"5\",\"referer\":\"\",\"type\":\"rest\",\"protocol\":\"HTTP/1.1\",\"remote_ip\":\"34.196.129.226\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/a51d46e3f2014110366b10017c5ba675\",\"value\":\"a51d46e3f2014110366b10017c5ba675\"},\"sys_created_on\":\"2025-09-26 16:06:44\",\"sql_time\":\"8\",\"potential_cpu_time\":\"640\",\"sys_created_by\":\"admin\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.01\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=224333909\",\"value\":\"224333909\"},\"request_param_size\":\"280\",\"db_category\":\"\",\"session\":\"A3C97F54C398F2100F321A2ED4013169\",\"sys_id\":\"e7c97b54c398f2100f321a2ed401316d\",\"client_network_time\":\"\",\"sql_count\":\"29\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-26 16:06:44\",\"table\":\"\",\"user_agent\":\"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)\",\"cpu_time\":\"7\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"1\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"true\",\"interaction_id\":\"\",\"url\":\"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-26T15:34:00.000Z^sys_created_on<2025-09-26T15:36:00.000Z&sysparm_limit=100\",\"browser_time\":\"\",\"largest_chunk_written\":\"512\",\"output_length\":\"608\",\"acl_time\":\"2\",\"ajax_transaction_count\":\"\",\"render_size\":\"2706\",\"transaction_number\":\"9917\",\"has_call_chain\":\"false\",\"response_time\":\"40\",\"transaction_processing_time\":\"40\",\"app_scope\":\"sn_vsc\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"b0b97bd8c35cf2100f321a2ed401316e","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-26T16:06:53.000Z","processed_time":1758904724273,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"business_rule_count":"13","request_param_size":"0","type":"scheduler","sql_count":"60","client_transaction":"false","start_process_at":"2025-09-26 16:06:16","sql_time":"33","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"0","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"false","largest_chunk_written":"0","transaction_pattern.value":"0","output_length":"0","acl_time":"0","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=0","render_size":"0","transaction_number":"4995262","origin_scope.value":"global","has_call_chain":"false","response_time":"37123","cpu_usage":"0.0","transaction_processing_time":"37123","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"b0b97bd8c35cf2100f321a2ed401316e","version":"","url":{"path":"JOB: Check Glide Service Status","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global","url_string":"JOB: Check Glide Service Status"},"user_agent":""},"time":1758902813000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":2375808,"cpu_count":243},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"13\",\"referer\":\"\",\"type\":\"scheduler\",\"protocol\":\"\",\"remote_ip\":\"\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global\",\"value\":\"global\"},\"sys_created_on\":\"2025-09-26 16:06:53\",\"sql_time\":\"33\",\"potential_cpu_time\":\"2375808\",\"sys_created_by\":\"system\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.0\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=0\",\"value\":\"0\"},\"request_param_size\":\"0\",\"db_category\":\"\",\"session\":\"glide.scheduler.worker.1\",\"sys_id\":\"b0b97bd8c35cf2100f321a2ed401316e\",\"client_network_time\":\"\",\"sql_count\":\"60\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-26 16:06:16\",\"table\":\"\",\"user_agent\":\"\",\"cpu_time\":\"243\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"0\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"false\",\"interaction_id\":\"\",\"url\":\"JOB: Check Glide Service Status\",\"browser_time\":\"\",\"largest_chunk_written\":\"0\",\"output_length\":\"0\",\"acl_time\":\"0\",\"ajax_transaction_count\":\"\",\"render_size\":\"0\",\"transaction_number\":\"4995262\",\"has_call_chain\":\"false\",\"response_time\":\"37123\",\"transaction_processing_time\":\"37123\",\"app_scope\":\"\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"02e9ff1cc35cf2100f321a2ed4013142","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-26T16:07:11.000Z","processed_time":1758904724275,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"business_rule_count":"30","request_param_size":"0","type":"scheduler","sql_count":"65","client_transaction":"false","start_process_at":"2025-09-26 16:07:10","sql_time":"31","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"1","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"false","largest_chunk_written":"0","transaction_pattern.value":"0","output_length":"0","acl_time":"0","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=0","render_size":"0","transaction_number":"4996556","origin_scope.value":"global","has_call_chain":"false","response_time":"1323","cpu_usage":"0.0","transaction_processing_time":"1323","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"02e9ff1cc35cf2100f321a2ed4013142","version":"","url":{"path":"JOB: Update Currency Conversion Rates","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global","url_string":"JOB: Update Currency Conversion Rates"},"user_agent":""},"time":1758902831000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":84544,"cpu_count":611},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"30\",\"referer\":\"\",\"type\":\"scheduler\",\"protocol\":\"\",\"remote_ip\":\"\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global\",\"value\":\"global\"},\"sys_created_on\":\"2025-09-26 16:07:11\",\"sql_time\":\"31\",\"potential_cpu_time\":\"84544\",\"sys_created_by\":\"admin\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.0\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=0\",\"value\":\"0\"},\"request_param_size\":\"0\",\"db_category\":\"\",\"session\":\"glide.scheduler.worker.2\",\"sys_id\":\"02e9ff1cc35cf2100f321a2ed4013142\",\"client_network_time\":\"\",\"sql_count\":\"65\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-26 16:07:10\",\"table\":\"\",\"user_agent\":\"\",\"cpu_time\":\"611\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"1\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"false\",\"interaction_id\":\"\",\"url\":\"JOB: Update Currency Conversion Rates\",\"browser_time\":\"\",\"largest_chunk_written\":\"0\",\"output_length\":\"0\",\"acl_time\":\"0\",\"ajax_transaction_count\":\"\",\"render_size\":\"0\",\"transaction_number\":\"4996556\",\"has_call_chain\":\"false\",\"response_time\":\"1323\",\"transaction_processing_time\":\"1323\",\"app_scope\":\"\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
