{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"274b215bc38472100f321a2ed40131be","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"flow.fire","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-23T03:10:13.000Z","processed_time":1758598964132,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"5","processed":"2025-09-23 03:10:14","instance":"af4b215b90847210ff373d28840da6bd","partition":"311","sys_updated_by":"system","process_on":"2025-09-23 03:10:13","sys_updated_on":"2025-09-23 03:10:14","queue":"flow_engine"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"274b215bc38472100f321a2ed40131be","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758597013000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":0},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"5\",\"instance\":\"af4b215b90847210ff373d28840da6bd\",\"process_on\":\"2025-09-23 03:10:13\",\"user_name\":\"admin\",\"sys_mod_count\":\"0\",\"sys_updated_on\":\"2025-09-23 03:10:14\",\"uri\":\"\",\"processed\":\"2025-09-23 03:10:14\",\"rollback_context_id\":\"\",\"sys_id\":\"274b215bc38472100f321a2ed40131be\",\"partition\":\"311\",\"sys_updated_by\":\"system\",\"user_id\":\"6816f79cc0a8016401c5a33be04be441\",\"sys_created_on\":\"2025-09-23 03:10:13\",\"processing_duration\":\"114\",\"name\":\"flow.fire\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"{\\\"originalInputs\\\":true,\\\"inputKey\\\":\\\"e34b215b95847210798a24b5e6151fbe\\\",\\\"retryAttempts\\\":1}\",\"queue\":\"flow_engine\",\"sys_created_by\":\"admin\",\"table\":\"sys_flow_context\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"274b215bc38472100f321a2ed40131bf","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"flow.fire","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-23T03:10:13.000Z","processed_time":1758598964134,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"5","processed":"2025-09-23 03:10:14","instance":"af4b215b37847210d82dbc9ea89e1abe","partition":"312","sys_updated_by":"system","process_on":"2025-09-23 03:10:13","sys_updated_on":"2025-09-23 03:10:14","queue":"flow_engine"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"274b215bc38472100f321a2ed40131bf","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758597013000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":0},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"5\",\"instance\":\"af4b215b37847210d82dbc9ea89e1abe\",\"process_on\":\"2025-09-23 03:10:13\",\"user_name\":\"admin\",\"sys_mod_count\":\"0\",\"sys_updated_on\":\"2025-09-23 03:10:14\",\"uri\":\"\",\"processed\":\"2025-09-23 03:10:14\",\"rollback_context_id\":\"\",\"sys_id\":\"274b215bc38472100f321a2ed40131bf\",\"partition\":\"312\",\"sys_updated_by\":\"system\",\"user_id\":\"6816f79cc0a8016401c5a33be04be441\",\"sys_created_on\":\"2025-09-23 03:10:13\",\"processing_duration\":\"63\",\"name\":\"flow.fire\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"{\\\"originalInputs\\\":true,\\\"inputKey\\\":\\\"e34b215be38472105b8a74a6858454bf\\\",\\\"retryAttempts\\\":1}\",\"queue\":\"flow_engine\",\"sys_created_by\":\"admin\",\"table\":\"sys_flow_context\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"d25b615bc38472100f321a2ed401316c","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"glide.heartbeat","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-23T03:10:24.000Z","processed_time":1758598964136,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"100","processed":"2025-09-23 03:10:31","sys_updated_on":"2025-09-23 03:10:31","partition":"141","sys_updated_by":"system","process_on":"2025-09-23 03:10:24"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"d25b615bc38472100f321a2ed401316c","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758597024000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":1},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"100\",\"instance\":\"\",\"process_on\":\"2025-09-23 03:10:24\",\"user_name\":\"\",\"sys_mod_count\":\"1\",\"sys_updated_on\":\"2025-09-23 03:10:31\",\"uri\":\"\",\"processed\":\"2025-09-23 03:10:31\",\"rollback_context_id\":\"\",\"sys_id\":\"d25b615bc38472100f321a2ed401316c\",\"partition\":\"141\",\"sys_updated_by\":\"system\",\"user_id\":\"\",\"sys_created_on\":\"2025-09-23 03:10:24\",\"processing_duration\":\"8\",\"name\":\"glide.heartbeat\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"\",\"queue\":\"\",\"sys_created_by\":\"system\",\"table\":\"\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"fc9b655bc38472100f321a2ed40131d7","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"glide.heartbeat","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-23T03:11:24.000Z","processed_time":1758598964138,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"100","processed":"2025-09-23 03:11:30","sys_updated_on":"2025-09-23 03:11:30","partition":"346","sys_updated_by":"system","process_on":"2025-09-23 03:11:24"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"fc9b655bc38472100f321a2ed40131d7","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758597084000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":1},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"100\",\"instance\":\"\",\"process_on\":\"2025-09-23 03:11:24\",\"user_name\":\"\",\"sys_mod_count\":\"1\",\"sys_updated_on\":\"2025-09-23 03:11:30\",\"uri\":\"\",\"processed\":\"2025-09-23 03:11:30\",\"rollback_context_id\":\"\",\"sys_id\":\"fc9b655bc38472100f321a2ed40131d7\",\"partition\":\"346\",\"sys_updated_by\":\"system\",\"user_id\":\"\",\"sys_created_on\":\"2025-09-23 03:11:24\",\"processing_duration\":\"1\",\"name\":\"glide.heartbeat\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"\",\"queue\":\"\",\"sys_created_by\":\"system\",\"table\":\"\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"1f6b6957c30472100f321a2ed40131f9","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-23T03:10:44.000Z","processed_time":1758598964378,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":"174.129.23.23"},"message":"","unmapped":{"business_rule_count":"0","request_param_size":"280","type":"rest","sql_count":"27","client_transaction":"false","start_process_at":"2025-09-23 03:10:44","sql_time":"10","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"0","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"true","largest_chunk_written":"512","transaction_pattern.value":"-1626936241","output_length":"982","acl_time":"4","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=-1626936241","render_size":"3459","transaction_number":"4698","origin_scope.value":"global","has_call_chain":"false","response_time":"36","cpu_usage":"0.0","transaction_processing_time":"36","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"1f6b6957c30472100f321a2ed40131f9","version":"HTTP/1.1","url":{"path":"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-23T02:38:00.000Z^sys_created_on<2025-09-23T02:40:00.000Z&sysparm_limit=100","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global","url_string":"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-23T02:38:00.000Z^sys_created_on<2025-09-23T02:40:00.000Z&sysparm_limit=100"},"user_agent":"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)"},"time":1758597044000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":896,"cpu_count":8},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"0\",\"referer\":\"\",\"type\":\"rest\",\"protocol\":\"HTTP/1.1\",\"remote_ip\":\"174.129.23.23\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global\",\"value\":\"global\"},\"sys_created_on\":\"2025-09-23 03:10:44\",\"sql_time\":\"10\",\"potential_cpu_time\":\"896\",\"sys_created_by\":\"admin\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.0\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=-1626936241\",\"value\":\"-1626936241\"},\"request_param_size\":\"280\",\"db_category\":\"\",\"session\":\"D76B6957C30472100F321A2ED40131F9\",\"sys_id\":\"1f6b6957c30472100f321a2ed40131f9\",\"client_network_time\":\"\",\"sql_count\":\"27\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-23 03:10:44\",\"table\":\"\",\"user_agent\":\"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)\",\"cpu_time\":\"8\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"0\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"true\",\"interaction_id\":\"\",\"url\":\"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-23T02:38:00.000Z^sys_created_on<2025-09-23T02:40:00.000Z&sysparm_limit=100\",\"browser_time\":\"\",\"largest_chunk_written\":\"512\",\"output_length\":\"982\",\"acl_time\":\"4\",\"ajax_transaction_count\":\"\",\"render_size\":\"3459\",\"transaction_number\":\"4698\",\"has_call_chain\":\"false\",\"response_time\":\"36\",\"transaction_processing_time\":\"36\",\"app_scope\":\"\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"876b6197c3c072100f321a2ed401319c","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-23T03:10:44.000Z","processed_time":1758598964379,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":"174.129.23.23"},"message":"","unmapped":{"business_rule_count":"5","request_param_size":"280","type":"rest","sql_count":"34","client_transaction":"false","start_process_at":"2025-09-23 03:10:44","sql_time":"12","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"2","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"true","largest_chunk_written":"350","transaction_pattern.value":"224333909","output_length":"360","acl_time":"1","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=224333909","render_size":"1176","transaction_number":"4697","origin_scope.value":"a51d46e3f2014110366b10017c5ba675","has_call_chain":"false","response_time":"42","cpu_usage":"0.0","transaction_processing_time":"42","app_scope":"sn_vsc","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"876b6197c3c072100f321a2ed401319c","version":"HTTP/1.1","url":{"path":"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-23T02:38:00.000Z^sys_created_on<2025-09-23T02:40:00.000Z&sysparm_limit=100","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/a51d46e3f2014110366b10017c5ba675","url_string":"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-23T02:38:00.000Z^sys_created_on<2025-09-23T02:40:00.000Z&sysparm_limit=100"},"user_agent":"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)"},"time":1758597044000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":640,"cpu_count":6},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"5\",\"referer\":\"\",\"type\":\"rest\",\"protocol\":\"HTTP/1.1\",\"remote_ip\":\"174.129.23.23\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/a51d46e3f2014110366b10017c5ba675\",\"value\":\"a51d46e3f2014110366b10017c5ba675\"},\"sys_created_on\":\"2025-09-23 03:10:44\",\"sql_time\":\"12\",\"potential_cpu_time\":\"640\",\"sys_created_by\":\"admin\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.0\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=224333909\",\"value\":\"224333909\"},\"request_param_size\":\"280\",\"db_category\":\"\",\"session\":\"436B2D97C3C072100F321A2ED4013191\",\"sys_id\":\"876b6197c3c072100f321a2ed401319c\",\"client_network_time\":\"\",\"sql_count\":\"34\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-23 03:10:44\",\"table\":\"\",\"user_agent\":\"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)\",\"cpu_time\":\"6\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"2\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"true\",\"interaction_id\":\"\",\"url\":\"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-23T02:38:00.000Z^sys_created_on<2025-09-23T02:40:00.000Z&sysparm_limit=100\",\"browser_time\":\"\",\"largest_chunk_written\":\"350\",\"output_length\":\"360\",\"acl_time\":\"1\",\"ajax_transaction_count\":\"\",\"render_size\":\"1176\",\"transaction_number\":\"4697\",\"has_call_chain\":\"false\",\"response_time\":\"42\",\"transaction_processing_time\":\"42\",\"app_scope\":\"sn_vsc\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
