{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"24c13d13c3c472100f321a2ed40131da","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"glide.heartbeat","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-23T03:38:24.000Z","processed_time":1758600644435,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"100","processed":"2025-09-23 03:38:31","sys_updated_on":"2025-09-23 03:38:31","partition":"26","sys_updated_by":"system","process_on":"2025-09-23 03:38:24"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"24c13d13c3c472100f321a2ed40131da","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758598704000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":1},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"100\",\"instance\":\"\",\"process_on\":\"2025-09-23 03:38:24\",\"user_name\":\"\",\"sys_mod_count\":\"1\",\"sys_updated_on\":\"2025-09-23 03:38:31\",\"uri\":\"\",\"processed\":\"2025-09-23 03:38:31\",\"rollback_context_id\":\"\",\"sys_id\":\"24c13d13c3c472100f321a2ed40131da\",\"partition\":\"26\",\"sys_updated_by\":\"system\",\"user_id\":\"\",\"sys_created_on\":\"2025-09-23 03:38:24\",\"processing_duration\":\"1\",\"name\":\"glide.heartbeat\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"\",\"queue\":\"\",\"sys_created_by\":\"system\",\"table\":\"\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"c3f17153c3c472100f321a2ed4013139","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"glide.heartbeat","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-23T03:39:24.000Z","processed_time":1758600644437,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"100","processed":"2025-09-23 03:39:30","sys_updated_on":"2025-09-23 03:39:30","partition":"83","sys_updated_by":"system","process_on":"2025-09-23 03:39:24"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"c3f17153c3c472100f321a2ed4013139","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758598764000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":1},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"100\",\"instance\":\"\",\"process_on\":\"2025-09-23 03:39:24\",\"user_name\":\"\",\"sys_mod_count\":\"1\",\"sys_updated_on\":\"2025-09-23 03:39:30\",\"uri\":\"\",\"processed\":\"2025-09-23 03:39:30\",\"rollback_context_id\":\"\",\"sys_id\":\"c3f17153c3c472100f321a2ed4013139\",\"partition\":\"83\",\"sys_updated_by\":\"system\",\"user_id\":\"\",\"sys_created_on\":\"2025-09-23 03:39:24\",\"processing_duration\":\"1\",\"name\":\"glide.heartbeat\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"\",\"queue\":\"\",\"sys_created_by\":\"system\",\"table\":\"\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"4e813913c3c472100f321a2ed40131a8","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-23T03:38:06.000Z","processed_time":1758600644661,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"business_rule_count":"13","request_param_size":"0","type":"scheduler","sql_count":"62","client_transaction":"false","start_process_at":"2025-09-23 03:37:25","sql_time":"13","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"0","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"false","largest_chunk_written":"0","transaction_pattern.value":"0","output_length":"0","acl_time":"0","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=0","render_size":"0","transaction_number":"1847808","origin_scope.value":"global","has_call_chain":"false","response_time":"41143","cpu_usage":"0.0","transaction_processing_time":"41143","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"4e813913c3c472100f321a2ed40131a8","version":"","url":{"path":"JOB: Check Glide Service Status","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global","url_string":"JOB: Check Glide Service Status"},"user_agent":""},"time":1758598686000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":2633024,"cpu_count":229},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"13\",\"referer\":\"\",\"type\":\"scheduler\",\"protocol\":\"\",\"remote_ip\":\"\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global\",\"value\":\"global\"},\"sys_created_on\":\"2025-09-23 03:38:06\",\"sql_time\":\"13\",\"potential_cpu_time\":\"2633024\",\"sys_created_by\":\"system\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.0\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=0\",\"value\":\"0\"},\"request_param_size\":\"0\",\"db_category\":\"\",\"session\":\"glide.scheduler.worker.0\",\"sys_id\":\"4e813913c3c472100f321a2ed40131a8\",\"client_network_time\":\"\",\"sql_count\":\"62\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-23 03:37:25\",\"table\":\"\",\"user_agent\":\"\",\"cpu_time\":\"229\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"0\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"false\",\"interaction_id\":\"\",\"url\":\"JOB: Check Glide Service Status\",\"browser_time\":\"\",\"largest_chunk_written\":\"0\",\"output_length\":\"0\",\"acl_time\":\"0\",\"ajax_transaction_count\":\"\",\"render_size\":\"0\",\"transaction_number\":\"1847808\",\"has_call_chain\":\"false\",\"response_time\":\"41143\",\"transaction_processing_time\":\"41143\",\"app_scope\":\"\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"15d1399bc3c072100f321a2ed4013138","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-23T03:38:44.000Z","processed_time":1758600644663,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":"174.129.23.23"},"message":"","unmapped":{"business_rule_count":"0","request_param_size":"280","type":"rest","sql_count":"22","client_transaction":"false","start_process_at":"2025-09-23 03:38:44","sql_time":"11","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"0","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"true","largest_chunk_written":"512","transaction_pattern.value":"-1626936241","output_length":"992","acl_time":"2","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=-1626936241","render_size":"3459","transaction_number":"4736","origin_scope.value":"global","has_call_chain":"false","response_time":"35","cpu_usage":"0.01","transaction_processing_time":"35","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"15d1399bc3c072100f321a2ed4013138","version":"HTTP/1.1","url":{"path":"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-23T03:06:00.000Z^sys_created_on<2025-09-23T03:08:00.000Z&sysparm_limit=100","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global","url_string":"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-23T03:06:00.000Z^sys_created_on<2025-09-23T03:08:00.000Z&sysparm_limit=100"},"user_agent":"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)"},"time":1758598724000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":960,"cpu_count":10},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"0\",\"referer\":\"\",\"type\":\"rest\",\"protocol\":\"HTTP/1.1\",\"remote_ip\":\"174.129.23.23\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global\",\"value\":\"global\"},\"sys_created_on\":\"2025-09-23 03:38:44\",\"sql_time\":\"11\",\"potential_cpu_time\":\"960\",\"sys_created_by\":\"admin\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.01\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=-1626936241\",\"value\":\"-1626936241\"},\"request_param_size\":\"280\",\"db_category\":\"\",\"session\":\"DDD1399BC3C072100F321A2ED4013137\",\"sys_id\":\"15d1399bc3c072100f321a2ed4013138\",\"client_network_time\":\"\",\"sql_count\":\"22\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-23 03:38:44\",\"table\":\"\",\"user_agent\":\"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)\",\"cpu_time\":\"10\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"0\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"true\",\"interaction_id\":\"\",\"url\":\"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-23T03:06:00.000Z^sys_created_on<2025-09-23T03:08:00.000Z&sysparm_limit=100\",\"browser_time\":\"\",\"largest_chunk_written\":\"512\",\"output_length\":\"992\",\"acl_time\":\"2\",\"ajax_transaction_count\":\"\",\"render_size\":\"3459\",\"transaction_number\":\"4736\",\"has_call_chain\":\"false\",\"response_time\":\"35\",\"transaction_processing_time\":\"35\",\"app_scope\":\"\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"55d1bd93c3c072100f321a2ed401318d","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-23T03:38:44.000Z","processed_time":1758600644665,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":"100.25.96.245"},"message":"","unmapped":{"business_rule_count":"5","request_param_size":"280","type":"rest","sql_count":"34","client_transaction":"false","start_process_at":"2025-09-23 03:38:44","sql_time":"9","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"2","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"true","largest_chunk_written":"346","transaction_pattern.value":"224333909","output_length":"356","acl_time":"0","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=224333909","render_size":"1176","transaction_number":"4735","origin_scope.value":"a51d46e3f2014110366b10017c5ba675","has_call_chain":"false","response_time":"39","cpu_usage":"0.0","transaction_processing_time":"39","app_scope":"sn_vsc","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"55d1bd93c3c072100f321a2ed401318d","version":"HTTP/1.1","url":{"path":"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-23T03:06:00.000Z^sys_created_on<2025-09-23T03:08:00.000Z&sysparm_limit=100","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/a51d46e3f2014110366b10017c5ba675","url_string":"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-23T03:06:00.000Z^sys_created_on<2025-09-23T03:08:00.000Z&sysparm_limit=100"},"user_agent":"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)"},"time":1758598724000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":512,"cpu_count":5},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"5\",\"referer\":\"\",\"type\":\"rest\",\"protocol\":\"HTTP/1.1\",\"remote_ip\":\"100.25.96.245\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/a51d46e3f2014110366b10017c5ba675\",\"value\":\"a51d46e3f2014110366b10017c5ba675\"},\"sys_created_on\":\"2025-09-23 03:38:44\",\"sql_time\":\"9\",\"potential_cpu_time\":\"512\",\"sys_created_by\":\"admin\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.0\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=224333909\",\"value\":\"224333909\"},\"request_param_size\":\"280\",\"db_category\":\"\",\"session\":\"11D17D93C3C072100F321A2ED401318E\",\"sys_id\":\"55d1bd93c3c072100f321a2ed401318d\",\"client_network_time\":\"\",\"sql_count\":\"34\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-23 03:38:44\",\"table\":\"\",\"user_agent\":\"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)\",\"cpu_time\":\"5\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"2\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"true\",\"interaction_id\":\"\",\"url\":\"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-23T03:06:00.000Z^sys_created_on<2025-09-23T03:08:00.000Z&sysparm_limit=100\",\"browser_time\":\"\",\"largest_chunk_written\":\"346\",\"output_length\":\"356\",\"acl_time\":\"0\",\"ajax_transaction_count\":\"\",\"render_size\":\"1176\",\"transaction_number\":\"4735\",\"has_call_chain\":\"false\",\"response_time\":\"39\",\"transaction_processing_time\":\"39\",\"app_scope\":\"sn_vsc\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
