{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"5b156f53c300b2100f321a2ed40131ef","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"glide.heartbeat","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-23T12:02:25.000Z","processed_time":1758630884148,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"100","processed":"2025-09-23 12:02:30","sys_updated_on":"2025-09-23 12:02:30","partition":"230","sys_updated_by":"system","process_on":"2025-09-23 12:02:25"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"5b156f53c300b2100f321a2ed40131ef","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758628945000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":1},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"100\",\"instance\":\"\",\"process_on\":\"2025-09-23 12:02:25\",\"user_name\":\"\",\"sys_mod_count\":\"1\",\"sys_updated_on\":\"2025-09-23 12:02:30\",\"uri\":\"\",\"processed\":\"2025-09-23 12:02:30\",\"rollback_context_id\":\"\",\"sys_id\":\"5b156f53c300b2100f321a2ed40131ef\",\"partition\":\"230\",\"sys_updated_by\":\"system\",\"user_id\":\"\",\"sys_created_on\":\"2025-09-23 12:02:25\",\"processing_duration\":\"1\",\"name\":\"glide.heartbeat\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"\",\"queue\":\"\",\"sys_created_by\":\"system\",\"table\":\"\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"b555a393c300b2100f321a2ed4013163","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"glide.heartbeat","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-23T12:03:24.000Z","processed_time":1758630884150,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"100","processed":"2025-09-23 12:03:30","sys_updated_on":"2025-09-23 12:03:30","partition":"250","sys_updated_by":"system","process_on":"2025-09-23 12:03:24"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"b555a393c300b2100f321a2ed4013163","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758629004000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":1},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"100\",\"instance\":\"\",\"process_on\":\"2025-09-23 12:03:24\",\"user_name\":\"\",\"sys_mod_count\":\"1\",\"sys_updated_on\":\"2025-09-23 12:03:30\",\"uri\":\"\",\"processed\":\"2025-09-23 12:03:30\",\"rollback_context_id\":\"\",\"sys_id\":\"b555a393c300b2100f321a2ed4013163\",\"partition\":\"250\",\"sys_updated_by\":\"system\",\"user_id\":\"\",\"sys_created_on\":\"2025-09-23 12:03:24\",\"processing_duration\":\"1\",\"name\":\"glide.heartbeat\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"\",\"queue\":\"\",\"sys_created_by\":\"system\",\"table\":\"\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"8c352793c3cc72100f321a2ed4013131","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-23T12:02:44.000Z","processed_time":1758630884375,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":"174.129.23.23"},"message":"","unmapped":{"business_rule_count":"5","request_param_size":"280","type":"rest","sql_count":"32","client_transaction":"false","start_process_at":"2025-09-23 12:02:44","sql_time":"17","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"1","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"true","largest_chunk_written":"512","transaction_pattern.value":"224333909","output_length":"602","acl_time":"4","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=224333909","render_size":"2706","transaction_number":"6856","origin_scope.value":"a51d46e3f2014110366b10017c5ba675","has_call_chain":"false","response_time":"64","cpu_usage":"0.01","transaction_processing_time":"64","app_scope":"sn_vsc","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"8c352793c3cc72100f321a2ed4013131","version":"HTTP/1.1","url":{"path":"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-23T11:30:00.000Z^sys_created_on<2025-09-23T11:32:00.000Z&sysparm_limit=100","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/a51d46e3f2014110366b10017c5ba675","url_string":"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-23T11:30:00.000Z^sys_created_on<2025-09-23T11:32:00.000Z&sysparm_limit=100"},"user_agent":"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)"},"time":1758628964000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":768,"cpu_count":9},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"5\",\"referer\":\"\",\"type\":\"rest\",\"protocol\":\"HTTP/1.1\",\"remote_ip\":\"174.129.23.23\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/a51d46e3f2014110366b10017c5ba675\",\"value\":\"a51d46e3f2014110366b10017c5ba675\"},\"sys_created_on\":\"2025-09-23 12:02:44\",\"sql_time\":\"17\",\"potential_cpu_time\":\"768\",\"sys_created_by\":\"admin\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.01\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=224333909\",\"value\":\"224333909\"},\"request_param_size\":\"280\",\"db_category\":\"\",\"session\":\"48356393C3CC72100F321A2ED4013134\",\"sys_id\":\"8c352793c3cc72100f321a2ed4013131\",\"client_network_time\":\"\",\"sql_count\":\"32\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-23 12:02:44\",\"table\":\"\",\"user_agent\":\"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)\",\"cpu_time\":\"9\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"1\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"true\",\"interaction_id\":\"\",\"url\":\"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-23T11:30:00.000Z^sys_created_on<2025-09-23T11:32:00.000Z&sysparm_limit=100\",\"browser_time\":\"\",\"largest_chunk_written\":\"512\",\"output_length\":\"602\",\"acl_time\":\"4\",\"ajax_transaction_count\":\"\",\"render_size\":\"2706\",\"transaction_number\":\"6856\",\"has_call_chain\":\"false\",\"response_time\":\"64\",\"transaction_processing_time\":\"64\",\"app_scope\":\"sn_vsc\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"c435e75fc38c72100f321a2ed4013143","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-23T12:02:44.000Z","processed_time":1758630884377,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":"100.25.96.245"},"message":"","unmapped":{"business_rule_count":"0","request_param_size":"280","type":"rest","sql_count":"28","client_transaction":"false","start_process_at":"2025-09-23 12:02:44","sql_time":"16","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"0","network_time":"0","total_wait_time":"1","largest_input_read":"0","gzip":"true","largest_chunk_written":"512","transaction_pattern.value":"-1626936241","output_length":"1154","acl_time":"5","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=-1626936241","render_size":"4962","transaction_number":"6857","origin_scope.value":"global","has_call_chain":"false","response_time":"49","cpu_usage":"0.0","transaction_processing_time":"48","semaphore_wait_time":"1"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"c435e75fc38c72100f321a2ed4013143","version":"HTTP/1.1","url":{"path":"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-23T11:30:00.000Z^sys_created_on<2025-09-23T11:32:00.000Z&sysparm_limit=100","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global","url_string":"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-23T11:30:00.000Z^sys_created_on<2025-09-23T11:32:00.000Z&sysparm_limit=100"},"user_agent":"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)"},"time":1758628964000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":1472,"cpu_count":13},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"0\",\"referer\":\"\",\"type\":\"rest\",\"protocol\":\"HTTP/1.1\",\"remote_ip\":\"100.25.96.245\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global\",\"value\":\"global\"},\"sys_created_on\":\"2025-09-23 12:02:44\",\"sql_time\":\"16\",\"potential_cpu_time\":\"1472\",\"sys_created_by\":\"admin\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.0\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"1\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=-1626936241\",\"value\":\"-1626936241\"},\"request_param_size\":\"280\",\"db_category\":\"\",\"session\":\"8035E35FC38C72100F321A2ED4013147\",\"sys_id\":\"c435e75fc38c72100f321a2ed4013143\",\"client_network_time\":\"\",\"sql_count\":\"28\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-23 12:02:44\",\"table\":\"\",\"user_agent\":\"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)\",\"cpu_time\":\"13\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"0\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"1\",\"gzip\":\"true\",\"interaction_id\":\"\",\"url\":\"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-23T11:30:00.000Z^sys_created_on<2025-09-23T11:32:00.000Z&sysparm_limit=100\",\"browser_time\":\"\",\"largest_chunk_written\":\"512\",\"output_length\":\"1154\",\"acl_time\":\"5\",\"ajax_transaction_count\":\"\",\"render_size\":\"4962\",\"transaction_number\":\"6857\",\"has_call_chain\":\"false\",\"response_time\":\"49\",\"transaction_processing_time\":\"48\",\"app_scope\":\"\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
