{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"2842fa53c30c72100f321a2ed4013125","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"flow.fire","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-23T08:20:13.000Z","processed_time":1758617564146,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"5","processed":"2025-09-23 08:20:14","instance":"a042fa53e50c7210e795804a3cc99225","partition":"212","sys_updated_by":"system","process_on":"2025-09-23 08:20:13","sys_updated_on":"2025-09-23 08:20:14","queue":"flow_engine"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"2842fa53c30c72100f321a2ed4013125","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758615613000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":0},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"5\",\"instance\":\"a042fa53e50c7210e795804a3cc99225\",\"process_on\":\"2025-09-23 08:20:13\",\"user_name\":\"admin\",\"sys_mod_count\":\"0\",\"sys_updated_on\":\"2025-09-23 08:20:14\",\"uri\":\"\",\"processed\":\"2025-09-23 08:20:14\",\"rollback_context_id\":\"\",\"sys_id\":\"2842fa53c30c72100f321a2ed4013125\",\"partition\":\"212\",\"sys_updated_by\":\"system\",\"user_id\":\"6816f79cc0a8016401c5a33be04be441\",\"sys_created_on\":\"2025-09-23 08:20:13\",\"processing_duration\":\"136\",\"name\":\"flow.fire\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"{\\\"originalInputs\\\":true,\\\"inputKey\\\":\\\"e442fa53af0c7210d637049300f24725\\\",\\\"retryAttempts\\\":1}\",\"queue\":\"flow_engine\",\"sys_created_by\":\"admin\",\"table\":\"sys_flow_context\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"2842fa53c30c72100f321a2ed4013126","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"flow.fire","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-23T08:20:13.000Z","processed_time":1758617564147,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"5","processed":"2025-09-23 08:20:14","instance":"a042fa53500c721086afe4fbfb485026","partition":"213","sys_updated_by":"system","process_on":"2025-09-23 08:20:13","sys_updated_on":"2025-09-23 08:20:14","queue":"flow_engine"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"2842fa53c30c72100f321a2ed4013126","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758615613000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":0},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"5\",\"instance\":\"a042fa53500c721086afe4fbfb485026\",\"process_on\":\"2025-09-23 08:20:13\",\"user_name\":\"admin\",\"sys_mod_count\":\"0\",\"sys_updated_on\":\"2025-09-23 08:20:14\",\"uri\":\"\",\"processed\":\"2025-09-23 08:20:14\",\"rollback_context_id\":\"\",\"sys_id\":\"2842fa53c30c72100f321a2ed4013126\",\"partition\":\"213\",\"sys_updated_by\":\"system\",\"user_id\":\"6816f79cc0a8016401c5a33be04be441\",\"sys_created_on\":\"2025-09-23 08:20:13\",\"processing_duration\":\"78\",\"name\":\"flow.fire\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"{\\\"originalInputs\\\":true,\\\"inputKey\\\":\\\"e442fa53370c7210f0179e6a41b9c526\\\",\\\"retryAttempts\\\":1}\",\"queue\":\"flow_engine\",\"sys_created_by\":\"admin\",\"table\":\"sys_flow_context\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"5f42fa53c30c72100f321a2ed401315f","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"glide.heartbeat","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-23T08:20:24.000Z","processed_time":1758617564149,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"100","processed":"2025-09-23 08:20:30","sys_updated_on":"2025-09-23 08:20:30","partition":"325","sys_updated_by":"system","process_on":"2025-09-23 08:20:24"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"5f42fa53c30c72100f321a2ed401315f","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758615624000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":1},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"100\",\"instance\":\"\",\"process_on\":\"2025-09-23 08:20:24\",\"user_name\":\"\",\"sys_mod_count\":\"1\",\"sys_updated_on\":\"2025-09-23 08:20:30\",\"uri\":\"\",\"processed\":\"2025-09-23 08:20:30\",\"rollback_context_id\":\"\",\"sys_id\":\"5f42fa53c30c72100f321a2ed401315f\",\"partition\":\"325\",\"sys_updated_by\":\"system\",\"user_id\":\"\",\"sys_created_on\":\"2025-09-23 08:20:24\",\"processing_duration\":\"0\",\"name\":\"glide.heartbeat\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"\",\"queue\":\"\",\"sys_created_by\":\"system\",\"table\":\"\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"b1823293c30c72100f321a2ed401314b","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"glide.heartbeat","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-23T08:21:24.000Z","processed_time":1758617564150,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":""},"message":"","unmapped":{"derived_priority":"100","processed":"2025-09-23 08:21:30","sys_updated_on":"2025-09-23 08:21:30","partition":"44","sys_updated_by":"system","process_on":"2025-09-23 08:21:24"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"b1823293c30c72100f321a2ed401314b","version":"","url":{"path":"","hostname":"","url_string":""},"user_agent":""},"time":1758615684000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"","hostname":"app130016.aus191.service-now.com:dev226905002","hw_info":{"cpu_bits":0,"cpu_count":0},"type_id":1},"web_resources_result":[],"raw_data":"{\"derived_priority\":\"100\",\"instance\":\"\",\"process_on\":\"2025-09-23 08:21:24\",\"user_name\":\"\",\"sys_mod_count\":\"1\",\"sys_updated_on\":\"2025-09-23 08:21:30\",\"uri\":\"\",\"processed\":\"2025-09-23 08:21:30\",\"rollback_context_id\":\"\",\"sys_id\":\"b1823293c30c72100f321a2ed401314b\",\"partition\":\"44\",\"sys_updated_by\":\"system\",\"user_id\":\"\",\"sys_created_on\":\"2025-09-23 08:21:24\",\"processing_duration\":\"1\",\"name\":\"glide.heartbeat\",\"descriptive_name\":\"\",\"state\":\"processed\",\"parm1\":\"\",\"parm2\":\"\",\"queue\":\"\",\"sys_created_by\":\"system\",\"table\":\"\",\"claimed_by\":\"app130016.aus191.service-now.com:dev226905002\"}","type_uid":600199,"status":"processed"}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"4062f297c3c872100f321a2ed4013130","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-23T08:20:44.000Z","processed_time":1758617564410,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":"100.25.96.245"},"message":"","unmapped":{"business_rule_count":"5","request_param_size":"280","type":"rest","sql_count":"29","client_transaction":"false","start_process_at":"2025-09-23 08:20:43","sql_time":"35","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"2","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"true","largest_chunk_written":"342","transaction_pattern.value":"224333909","output_length":"352","acl_time":"2","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=224333909","render_size":"1176","transaction_number":"5309","origin_scope.value":"a51d46e3f2014110366b10017c5ba675","has_call_chain":"false","response_time":"94","cpu_usage":"0.0","transaction_processing_time":"94","app_scope":"sn_vsc","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"4062f297c3c872100f321a2ed4013130","version":"HTTP/1.1","url":{"path":"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-23T07:48:00.000Z^sys_created_on<2025-09-23T07:50:00.000Z&sysparm_limit=100","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/a51d46e3f2014110366b10017c5ba675","url_string":"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-23T07:48:00.000Z^sys_created_on<2025-09-23T07:50:00.000Z&sysparm_limit=100"},"user_agent":"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)"},"time":1758615644000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":512,"cpu_count":5},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"5\",\"referer\":\"\",\"type\":\"rest\",\"protocol\":\"HTTP/1.1\",\"remote_ip\":\"100.25.96.245\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/a51d46e3f2014110366b10017c5ba675\",\"value\":\"a51d46e3f2014110366b10017c5ba675\"},\"sys_created_on\":\"2025-09-23 08:20:44\",\"sql_time\":\"35\",\"potential_cpu_time\":\"512\",\"sys_created_by\":\"admin\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.0\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=224333909\",\"value\":\"224333909\"},\"request_param_size\":\"280\",\"db_category\":\"\",\"session\":\"0C623297C3C872100F321A2ED4013132\",\"sys_id\":\"4062f297c3c872100f321a2ed4013130\",\"client_network_time\":\"\",\"sql_count\":\"29\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-23 08:20:43\",\"table\":\"\",\"user_agent\":\"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)\",\"cpu_time\":\"5\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"2\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"true\",\"interaction_id\":\"\",\"url\":\"/api/now/v2/table/sysevent?sysparm_query=sys_created_on>=2025-09-23T07:48:00.000Z^sys_created_on<2025-09-23T07:50:00.000Z&sysparm_limit=100\",\"browser_time\":\"\",\"largest_chunk_written\":\"342\",\"output_length\":\"352\",\"acl_time\":\"2\",\"ajax_transaction_count\":\"\",\"render_size\":\"1176\",\"transaction_number\":\"5309\",\"has_call_chain\":\"false\",\"response_time\":\"94\",\"transaction_processing_time\":\"94\",\"app_scope\":\"sn_vsc\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
{"activity_name":"Other","category_uid":6,"web_resources":[],"metadata":{"uid":"48623a93c3c872100f321a2ed401310c","product":{"name":"ServiceNow","vendor_name":"ServiceNow"},"event_code":"","profiles":["host","network_proxy","security_control"],"original_time":"2025-09-23T08:20:44.000Z","processed_time":1758617564411,"version":"1.1.0","log_provider":"AWS AppFabric","log_version":"2024-04-12"},"type_name":"Web Resources Activity: Other","category_name":"Application Activity","src_endpoint":{"ip":"34.196.129.226"},"message":"","unmapped":{"business_rule_count":"0","request_param_size":"280","type":"rest","sql_count":"27","client_transaction":"false","start_process_at":"2025-09-23 08:20:44","sql_time":"17","phase1_form_length":"0","session_wait_time":"0","business_rule_time":"0","network_time":"0","total_wait_time":"0","largest_input_read":"0","gzip":"true","largest_chunk_written":"512","transaction_pattern.value":"-1626936241","output_length":"982","acl_time":"5","transaction_pattern.link":"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=-1626936241","render_size":"3459","transaction_number":"5310","origin_scope.value":"global","has_call_chain":"false","response_time":"43","cpu_usage":"0.0","transaction_processing_time":"43","semaphore_wait_time":"0"},"action_id":0,"class_uid":6001,"activity_id":99,"http_request":{"uid":"48623a93c3c872100f321a2ed401310c","version":"HTTP/1.1","url":{"path":"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-23T07:48:00.000Z^sys_created_on<2025-09-23T07:50:00.000Z&sysparm_limit=100","hostname":"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global","url_string":"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-23T07:48:00.000Z^sys_created_on<2025-09-23T07:50:00.000Z&sysparm_limit=100"},"user_agent":"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)"},"time":1758615644000,"severity_id":0,"class_name":"Web Resources Activity","device":{"uid":"app130016.aus191.service-now.com:dev226905002","hostname":"","hw_info":{"cpu_bits":960,"cpu_count":9},"type_id":0},"web_resources_result":[],"raw_data":"{\"business_rule_count\":\"0\",\"referer\":\"\",\"type\":\"rest\",\"protocol\":\"HTTP/1.1\",\"remote_ip\":\"34.196.129.226\",\"ui_policy_time\":\"\",\"origin_scope\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_scope/global\",\"value\":\"global\"},\"sys_created_on\":\"2025-09-23 08:20:44\",\"sql_time\":\"17\",\"potential_cpu_time\":\"960\",\"sys_created_by\":\"admin\",\"db_pool\":\"\",\"session_wait_time\":\"0\",\"total_page_load_time\":\"\",\"largest_input_read\":\"0\",\"clotho_time\":\"\",\"additional_info\":\"\",\"additional_debug_info\":\"\",\"cpu_usage\":\"0.0\",\"client_response_time\":\"\",\"semaphore_wait_time\":\"0\",\"transaction_pattern\":{\"link\":\"https://dev226905.service-now.com/api/now/v2/table/sys_transaction_pattern?hash=-1626936241\",\"value\":\"-1626936241\"},\"request_param_size\":\"280\",\"db_category\":\"\",\"session\":\"04623E93C3C872100F321A2ED4013108\",\"sys_id\":\"48623a93c3c872100f321a2ed401310c\",\"client_network_time\":\"\",\"sql_count\":\"27\",\"client_transaction\":\"false\",\"start_process_at\":\"2025-09-23 08:20:44\",\"table\":\"\",\"user_agent\":\"Apache-HttpClient/UNAVAILABLE (Java/17.0.15)\",\"cpu_time\":\"9\",\"phase1_form_length\":\"0\",\"business_rule_time\":\"0\",\"system_id\":\"app130016.aus191.service-now.com:dev226905002\",\"view_id\":\"\",\"client_script_time\":\"\",\"network_time\":\"0\",\"total_wait_time\":\"0\",\"gzip\":\"true\",\"interaction_id\":\"\",\"url\":\"/api/now/v2/table/syslog_transaction?sysparm_query=sys_created_on>=2025-09-23T07:48:00.000Z^sys_created_on<2025-09-23T07:50:00.000Z&sysparm_limit=100\",\"browser_time\":\"\",\"largest_chunk_written\":\"512\",\"output_length\":\"982\",\"acl_time\":\"5\",\"ajax_transaction_count\":\"\",\"render_size\":\"3459\",\"transaction_number\":\"5310\",\"has_call_chain\":\"false\",\"response_time\":\"43\",\"transaction_processing_time\":\"43\",\"app_scope\":\"\",\"clotho_count\":\"\"}","type_uid":600199,"status":null}
